import { RawDict } from './types';

const soft = '\u0652(?=[еёіюяь])';
const presoft = '([تزكثࢮбвгджзйклмнпрстфхцчшў])\u0652?(\u0651?)';

export const rawArabLetters: RawDict = [
	[' لا', / л[ая]/],
	['ـلا', /л[ая]/],
	['$1\u0651', /([бвгджзйклмнпрстфхцчшў]|д[зж])\1/], // падваеньне зычнага, шадда
	['$1\u0652', /([бвгджзйклмнпрстфхцчшў])/], // няма галоснага, сукун
	['\u0627а', /а/], // а, аліф
	[' \u0627', / (?=[еэыуо])/], // першая галосная, аліф
	['ࢮ', 'д\u0652з' + soft],
	['ز', 'з' + soft],
	['ك', 'к' + soft],
	['ث', 'с' + soft],
	['ت', 'т' + soft],
	['ы', /([تزكث])і/],
	// $2 - шадда
	['$1$2\u064E', presoft + '[аяэе]'],
	['$1$2\u0650', presoft + '[іы]'],
	[' \u0627\u0650 ', / і /],
	['$1$2\u064F', presoft + '[оёую]'],
	['ع', /ʼ/],
	['', /ь/],
	// ['', /[ьʼ]/],
	['ي\u064E', /[яе]/],
	['ي\u0650', /і/],
	['ي\u064F', /[ёю]/],
	['\u064E', /[аэ]/],
	['\u0650', /[ыі]/],
	['\u064F', /[оу]/],
	['ب', /б/],
	['و', /[вў]/],
	['ه', /г/],
	['غ', /ґ/],
	['ج', /д\u0652ж/],
	['د', /д/],
	['ژ', /ж/],
	['ض', /з/],
	['ي', /й/],
	['ق', /к/],
	['ل', /л/],
	['م', /м/],
	['ن', /н/],
	['پ', /п/],
	['ر', /р/],
	['ص', /с/],
	['ط', /т/],
	['ف', /ф/],
	['ح', /х/],
	['ࢯ', /ц/],
	['چ', /ч/],
	['ش', /ш/],
	['،', /\,/],
	['؟', /\?/],
];
// let presoft = '([تزكثࢮбвгджзйклмнпрстфхцчшў\u0627])\u0652?(\u0651?)';

// const arabLetters = {
// [' لا', / л[ая]/],
// ['ـلا', /л[ая]/],
// ['$1\u0651', /([бвгджзйклмнпрстфхцчшў]|д[зж])\1/], // падваеньне зычнага, шадда
// ['$1\u0652', /([бвгджзйклмнпрстфхцчшў])/], // няма галоснага, сукун
// [' \u0627$1', / ([аеэіыуо])/], // першая галосная, аліф
// ['ࢮ$1', /д\u0652з/]+soft,
// ['ز$1', /з/]+soft,
// ['ك$1', /к/]+soft,
// ['ث$1', /с/]+soft,
// ['ت$1', /т/]+soft,
// ['$1ы', /([تزكث])і/],
// // $2 - шадда
// '$1$2\u064E':presoft+'[аяэе]',
// '$1$2\u0650':presoft+'[іы]',
// '$1$2\u064F':presoft+'[оёую]',
// ['', /[ьʼ]/],
// ['ي\u064E', /[яе]/],
// ['ي\u0650', /і/],
// ['ي\u064F', /[ёю]/],
// ['\u064E', /[аэ]/],
// ['\u0650', /[ыі]/],
// ['\u064F', /[оу]/],
// ['ب', /б/],
// ['و', /[вў]/],
// ['ه', /г/],
// ['غ', /ґ/],
// ['ج', /д\u0652ж/],
// ['د', /д/],
// ['ژ', /ж/],
// ['ض', /з/],
// ['ي', /й/],
// ['ق', /к/],
// ['ل', /л/],
// ['م', /м/],
// ['ن', /н/],
// ['پ', /п/],
// ['ر', /р/],
// ['ص', /с/],
// ['ط', /т/],
// ['ف', /ф/],
// ['ح', /х/],
// ['ࢯ', /ц/],
// ['چ', /ч/],
// ['ش', /ш/],
// ['،', /\,/],
// ['؟', /\?/]
// };
