export const toOneLine = (str: string): string => str.replace(/\n/g, '|');

/**
 * Words with first `i` letter stressed
 */
export const iwords = toOneLine(`біс
бсэн
в[аеоы] 
верс
вал[гз]
гар
грышч
грэк
дал
дыш
жыц
канапіс
кань?н
ка[цўл]
каў[кц]
ксі
леус
л(іст| )
лістас
льк
мант
мась?ц
мбры[кч]
менна 
мідж
мпар[тц]
мпульс[аеуы]
нахадз
нды([ійюя] |ев)
ндэкс(а(ў|мі?)? |[еуыі])
н[еі][ейяю]
нк([аіу])
нтэрым
нфікс
нфімум
ншась?ц
нш(а[ейя]?|ась?ц|ую|ы(мі|х|я)?) 
псілан
р([аыу]|а[мхйў]|амі|) 
рад
рбіс
рмас
рха
рыс 
скарк
скарак
скра
скравец
скрачк
ста 
с[нт]ась?ц
сь?ці[нк]
та[р ]
тры
х(ны[хя]?|ную|на[яей])?
ць?він
шыяс`);
