import type { Dict, WritableDict } from './types';
import { iwords } from './iwords';
import { dictFrom } from './lib';

const common = {
	lower: (
		[
			[
				[/(?<=[аеёіоуўыэюяьʼ| >АЕЁІОУЎЫЭЮЯЬ]|^)е/, 'je'],
				[/(?<=[eаеёіоуўыэюяьʼ| >АЕЁІОУЎЫЭЮЯЬ]|^)ё/, 'jo'],
				[/(?<=[eoаеёіоуўыэюяьʼ| >АЕЁІОУЎЫЭЮЯЬ]|^)ю/, 'ju'],
				[/(?<=[eouаеёіоуўыэюяьʼ| >АЕЁІОУЎЫЭЮЯЬ]|^)я/, 'ja'],
			],
			[
				[/ʼ/, ''],
				[/ць/, 'ć'],
				[/зь/, 'ź'],
				[/сь/, 'ś'],
				[/нь/, 'ń'],
				[/ль/, 'l'],
				[/а/, 'a'],
				[/б/, 'b'],
				[/в/, 'v'],
				[/г/, 'h'],
				[/ґ/, 'g'],
				[/д/, 'd'],
				[/е/, 'ie'],
				[/ё/, 'io'],
				[/ж/, 'ž'],
				[/з/, 'z'],
				[/і/, 'i'],
				[/й/, 'j'],
				[/к/, 'k'],
				[/л/, 'ł'],
				[/м/, 'm'],
				[/н/, 'n'],
				[/о/, 'o'],
				[/п/, 'p'],
				[/р/, 'r'],
				[/с/, 's'],
				[/т/, 't'],
				[/у/, 'u'],
				[/ў/, 'ŭ'],
				[/ф/, 'f'],
				[/х/, 'ch'],
				[/ц/, 'c'],
				[/ч/, 'č'],
				[/ш/, 'š'],
				[/ы/, 'y'],
				[/э/, 'e'],
				[/ю/, 'iu'],
				[/я/, 'ia'],
				[/łi(?=[eoua])/, 'l'],
				[/łi/, 'li'],
			],
		] satisfies WritableDict[]
	).map(dictFrom.nonGlobal),
	upper: (
		[
			[
				[/ Е(?=[ \p{P}\d]*\p{Lu}?\p{Ll})/u, ' Je'],
				[/ Ё(?=[ \p{P}\d]*\p{Lu}?\p{Ll})/u, ' Jo'],
				[/ Ю(?=[ \p{P}\d]*\p{Lu}?\p{Ll})/u, ' Ju'],
				[/ Я(?=[ \p{P}\d]*\p{Lu}?\p{Ll})/u, ' Ja'],
			],
			[
				[/([АЕЁІОУЎЫЭЮЯЬ| ]\(?)Е/, '$1JE'],
				[/([EАЕЁІОУЎЫЭЮЯЬ| ]\(?)Ё/, '$1JO'],
				[/([EOАЕЁІОУЎЫЭЮЯЬ| ]\(?)Ю/, '$1JU'],
				[/([EOUАЕЁІОУЎЫЭЮЯЬ| ]\(?)Я/, '$1JA'],
			],
			[
				[/Е/, 'IE'],
				[/Ё/, 'IO'],
				[/Ю/, 'IU'],
				[/Я/, 'IA'],
				[/Ц[Ьь]/, 'Ć'],
				[/З[Ьь]/, 'Ź'],
				[/С[Ьь]/, 'Ś'],
				[/Н[Ьь]/, 'Ń'],
				[/Л[Ьь]/, 'L'],
				[/А/, 'A'],
				[/Б/, 'B'],
				[/В/, 'V'],
				[/Г/, 'H'],
				[/Ґ/, 'G'],
				[/Д/, 'D'],
				[/Ж/, 'Ž'],
				[/З/, 'Z'],
				[/І/, 'I'],
				[/Й/, 'J'],
				[/К/, 'K'],
				[/Л/, 'Ł'],
				[/М/, 'M'],
				[/Н/, 'N'],
				[/О/, 'O'],
				[/П/, 'P'],
				[/Р/, 'R'],
				[/С/, 'S'],
				[/Т/, 'T'],
				[/У/, 'U'],
				[/Ў/, 'Ŭ'],
				[/Ф/, 'F'],
				[/ Х(?=[\p{Ll} ])/u, ' Ch'],
				[/Х/, 'CH'],
				[/Ц/, 'C'],
				[/Ч/, 'Č'],
				[/Ш/, 'Š'],
				[/Ы/, 'Y'],
				[/Э/, 'E'],
				[/Ł[Ii](?=[AEOUaeou])/, 'L'],
				[/Ł(?=[Ii])/, 'L'],
			],
		] satisfies WritableDict[]
	).map(dictFrom.nonGlobal),
};

export const latinLettersLowerCase = [
	...common.lower[0],
	[/ʼі/g, 'ji'],
	...common.lower[1],
] satisfies Dict;

export const latinLettersUpperCase = common.upper.flat();

export const latinLettersLowerCaseJi = dictFrom
	.raw([
		[/([аеёіоуыэюяАЕЁІОУЫЭЮЯ] )і Ў/, '$1j U'],
		[/([аеёіоуыэюяАЕЁІОУЫЭЮЯ] )і ў/, '$1j u'],
		[/([аеёіоуыэюяАЕЁІОУЫЭЮЯ] )і /, '$1j '],
		[/([аеёіоуыэюяАЕЁІОУЫЭЮЯ] )І Ў/, '$1J U'],
		[/([аеёіоуыэюяАЕЁІОУЫЭЮЯ] )І ў/, '$1J u'],
		[/([аеёіоуыэюяАЕЁІОУЫЭЮЯ] )І /, '$1J '],
		[` і(?=${iwords})`, ' ji'],
		[` І(?=${iwords})`, ' Ji'],
		[` І(?=${iwords.toUpperCase()})`, ' JI'],
	])
	.concat([
		...common.lower[0],
		[/([eouaаеёіоуыэюяʼАЕЁІОУЫЭЮЯЬ] *)і/g, '$1ji'],
		...common.lower[1],
	]) satisfies Dict;

export const latinLettersUpperCaseJi = [
	...common.upper[0],
	[/([eoua] *)І(?=[ \p{P}\d]*\p{Lu}?\p{Ll})/gu, '$1Ji'],
	...common.upper[1],
	[/([AOEUАЕЁІОУЎЫЭЮЯ][( ]*)І/g, '$1JI'],
	...common.upper[2],
	[/ JIŁ -/g, ' IŁ -'],
] satisfies Dict;
