import { callableDict } from './lib';
import { re } from '../lib';
import { iwords } from './iwords';

export const noSoften = callableDict([
	[/масфільм/g, 'мас\ue0ffфільм'],
	[/пэндзлік/g, 'пэндз\ue0ffлік'],
	[/ ((?:[пн]|пе?р)?)аддз/g, ' $1ад\ue0ffдз'],
]);

export const softeners = callableDict([
	[/([лнц])\1(?=[еёіюяь])/g, '$1ь$1'],
	[/(\S\S)дз?дз(?=[еёіюяь])/g, '$1дзьдз'],
	[/з(?=(?:[бвзлмнц]|дз)[еёіюяь])/g, 'зь'],
	[/с(?=[бвлмнпсфц][еёіюяь])/g, 'сь'],
	[/ц(?=[вм][еёіюяь])/g, 'ць'],
	[
		re.g(
			`( (?:б[ея]|пра|цера)?з) (?=\\(?)(?=[еёюяь]|([бвзйлмнпстфц]|дз)[еёіюяь]|імі? |іх(?:ні)?|і(?:${iwords}))`
		),
		'$1ь ',
	],
	[/([сз])ʼ(?=[яюеё])/g, '$1ь'],
]);
