use crate::pipeline::{helpers::regex_replace_all, PipelineContext};

pub fn step_iotacize_ji(ctx: &mut PipelineContext) {
    let text = std::mem::take(&mut ctx.text);
    let mut result = text.clone();
    result = regex_replace_all(&result, r"([аеёіоуыэюя\u0301] )і ў", "$1й у");
    result = regex_replace_all(&result, r"([аеёіоуыэюя\u0301] )і ", "$1й ");
    result = regex_replace_all(&result, r"([аеёіоуыэюя\u0301] ?)і", "$1йі");
    result = regex_replace_all(
        &result,
        r" і(?=\u{301}|біс|бсэн|в[аеоы] |верс|вал[гз]|гар|грышч|грэк|дал|дыш|жыц|канапіс|кань?н|ка[цўл]|каў[кц]|кл(ыя?|а([яей]|га|му)|ую) |ксі|леус|л(іст| )|лістас|льк|м |мант|мась?ц|мбры[кч]|менна |мідж|мпар[тц]|мпульс[аеуы]|нахадз|нды([ійюя] |ев)|ндэкс(а(ў|мі?)? |[еуыі])|н[еі][ейяю]|нк([аіу])|нтэрым|нфікс|нфімум|ншась?ц|нш(а[ейя]?|ага|аму|ась?ц|ую|ы(мі?|х|я)?) |псілан|р([аыу]|а[мхйў]|амі|) |рад|рбіс|рмас|рха|рыс |скарк|скарак|скра|скравец|скрачк|ста |с[нт]ась?ц|сь?ці[нк]|та[р ]|тры|х(ны[хя]?|ную|на[яей])?|ць?він|шыяс)",
        " йі",
    );
    ctx.text = result;
}
