// src/dict/arabic.t
var latinLetters = [
	[/(?<=[аеёіоуыэюяьʼ| ]\(?)е/, 'je'],
	[/(?<=[аеёіоуыэюяьʼ| ]\(?)ё/, 'jo'],
	[/(?<=[аеёіоуыэюяьʼ| ]\(?)ю/, 'ju'],
	[/(?<=[аеёіоуыэюяьʼ| ]\(?)я/, 'ja'],
	[/ʼ/, ''],
	[/ць/, 'ć'],
	[/зь/, 'ź'],
	[/сь/, 'ś'],
	[/нь/, 'ń'],
	[/ль/, 'l'],
	[/а/, 'a'],
	[/б/, 'b'],
	[/в/, 'v'],
	[/г/, 'h'],
	[/ґ/, 'g'],
	[/д/, 'd'],
	[/е/, 'ie'],
	[/ё/, 'io'],
	[/ж/, 'ž'],
	[/з/, 'z'],
	[/і/, 'i'],
	[/й/, 'j'],
	[/к/, 'k'],
	[/л/, 'ł'],
	[/м/, 'm'],
	[/н/, 'n'],
	[/о/, 'o'],
	[/п/, 'p'],
	[/р/, 'r'],
	[/с/, 's'],
	[/т/, 't'],
	[/у/, 'u'],
	[/ў/, 'ŭ'],
	[/ф/, 'f'],
	[/х/, 'ch'],
	[/ц/, 'c'],
	[/ч/, 'č'],
	[/ш/, 'š'],
	[/ы/, 'y'],
	[/э/, 'e'],
	[/ю/, 'iu'],
	[/я/, 'ia'],
	[/[łl]i([eoua])/, 'l$1'],
	[/łi/, 'li'],
];
var latinLettersUpperCase = [
	[/ Е(?= *\p{Ll})/u, ' Je'],
	[/ Ё(?= *\p{Ll})/u, ' Jo'],
	[/ Ю(?= *\p{Ll})/u, ' Ju'],
	[/ Я(?= *\p{Ll})/u, ' Ja'],
	[/(?<=[АЕЁІОУЫЭЮЯЬʼ| ]\(?)Е/, 'JE'],
	[/(?<=[АЕЁІОУЫЭЮЯЬʼ| ]\(?)Ё/, 'JO'],
	[/(?<=[АЕЁІОУЫЭЮЯЬʼ| ]\(?)Ю/, 'JU'],
	[/(?<=[АЕЁІОУЫЭЮЯЬʼ| ]\(?)Я/, 'JA'],
	[/Е/, 'IE'],
	[/Ё/, 'IO'],
	[/Ю/, 'IU'],
	[/Я/, 'IA'],
	[/Ц[Ьь]/, 'Ć'],
	[/З[Ьь]/, 'Ź'],
	[/С[Ьь]/, 'Ś'],
	[/Н[Ьь]/, 'Ń'],
	[/Л[Ьь]/, 'L'],
	[/А/, 'A'],
	[/Б/, 'B'],
	[/В/, 'V'],
	[/Г/, 'H'],
	[/Ґ/, 'G'],
	[/Д/, 'D'],
	[/Ж/, 'Ž'],
	[/З/, 'Z'],
	[/І/, 'I'],
	[/Й/, 'J'],
	[/К/, 'K'],
	[/Л/, 'Ł'],
	[/М/, 'M'],
	[/Н/, 'N'],
	[/О/, 'O'],
	[/П/, 'P'],
	[/Р/, 'R'],
	[/С/, 'S'],
	[/Т/, 'T'],
	[/У/, 'U'],
	[/Ў/, 'Ŭ'],
	[/Ф/, 'F'],
	[/ Х(?=[\p{Ll} ])/u, ' Ch'],
	[/Х/, 'CH'],
	[/Ц/, 'C'],
	[/Ч/, 'Č'],
	[/Ш/, 'Š'],
	[/Ы/, 'Y'],
	[/Э/, 'E'],
	[/[ŁL][Ii]([AEOUaeou])/, 'L$1'],
	[/Łi/, 'Li'],
	[/ŁI/, 'LI'],
];

// src/dict/arabic.t
var greekLetters = [
	[/а/, 'α'],
	[/б/, 'μπ'],
	[/в/, 'β'],
	[/г/, 'γ'],
	[/ґ/, 'γκ'],
	[/д/, 'δ'],
	[/е/, 'η'],
	[/ё/, 'υο'],
	[/ж/, 'ζ̌'],
	[/з/, 'ζ'],
	[/і/, 'ι'],
	[/й/, 'υ'],
	[/к/, 'κ'],
	[/л/, 'λ'],
	[/мп/, 'μ‘π'],
	[/м/, 'μ'],
	[/н/, 'ν'],
	[/о/, 'ο'],
	[/п/, 'π'],
	[/р/, 'ρ'],
	[/с/, 'σ'],
	[/сь/, 'ς'],
	[/т/, 'τ'],
	[/у/, 'ϋ'],
	[/ў/, 'ΰ'],
	[/ф/, 'φ'],
	[/х/, 'χ'],
	[/ц/, 'τσ'],
	[/ць/, 'τς'],
	[/ч/, 'τσ̌'],
	[/ш/, 'σ̌'],
	[/ы/, 'ί'],
	[/э/, 'ε'],
	[/ю/, 'υϋ'],
	[/я/, 'υα'],
	[/ь/, '’'],
];
var greekLettersUpperCase = [
	[/ Б(?= *\p{Ll})/u, ' Μπ'],
	[/ Ґ(?= *\p{Ll})/u, ' Γκ'],
	[/ Ё(?= *\p{Ll})/u, ' Υο'],
	[/ Ю(?= *\p{Ll})/u, ' Υϋ'],
	[/ Я(?= *\p{Ll})/u, ' Υα'],
	[/ Ч(?= *\p{Ll})/u, ' Τσ̌'],
	[/Б/, 'ΜΠ'],
	[/Ґ/, 'ΓΚ'],
	[/Ё/, 'ΥΟ'],
	[/Ю/, 'ΥΫ'],
	[/Я/, 'ΥΑ'],
	[/Ч/, 'ΤΣ̌'],
	[/А/, 'Α'],
	[/В/, 'Β'],
	[/Г/, 'Γ'],
	[/Д/, 'Δ'],
	[/Е/, 'Η'],
	[/Ж/, 'Ζ̌'],
	[/З/, 'Ζ'],
	[/І/, 'Ι'],
	[/Й/, 'Υ'],
	[/К/, 'Κ'],
	[/Л/, 'Λ'],
	[/МП/, 'Μ‘Π'],
	[/Мп/, 'Μ‘π'],
	[/М/, 'Μ'],
	[/Н/, 'Ν'],
	[/О/, 'Ο'],
	[/П/, 'Π'],
	[/Р/, 'Ρ'],
	[/С/, 'Σ'],
	[/С[Ьь]/, 'ς'],
	[/Т/, 'Τ'],
	[/У/, 'Ϋ'],
	[/Ў/, 'Ϋ́'],
	[/Ф/, 'Φ'],
	[/Х/, 'Χ'],
	[/Ц/, 'Τσ'],
	[/Ц[Ьь]/, 'Τς'],
	[/Ш/, 'Σ̌'],
	[/Ы/, 'Ί'],
	[/Э/, 'Ε'],
	[/Ь/, '’'],
];
var thWords = [
	[/тэі(?=зм|ст)/, 'θει'],
	[/ агат/, ' αγαθ'],
	[/ анатэм/, ' αναθεμ'],
	[/антрапа/, 'ανθραπα'],
	[/ апатэ(?=оз|аты|м)/, ' απαθε'],
	[/ арта(?=графі|д[ао]кс|эпі)/, ' αρθα'],
	[/ арытмэт/, ' αρίθμετ'],
	[/ атэн/, ' αθεν'],
	[/ калітэ/, ' καλιθε'],
	[/ катэд(?=\(?а?р)/, ' καθεδ'],
	[/лябірынт/, 'λυαμπιρίνθ'],
	[/лягарытм/, 'λυαγαρίθμ'],
	[/ мар[фт]ы /, ' μαρθί '],
	[/ марфе /, ' μαρθη '],
	[/ матэматы/, ' μαθεματί'],
	[/ міт(?=[ауы]|оляг| )/, ' μιθ'],
	[/ мэт(?=[ао]д)/, ' μεθ'],
	[/пат(?=ал[ёя]гі|оляг|ычн|ыя|ы[ійю] |[ауы] |а[ўм] |амі | )/, 'παθ'],
	[/ пітагор/, ' πιθαγορ'],
	[/ ры[тф]м/, ' ρίθμ'],
	[/сынтэ[зт]/, 'σίνθετ'],
	[/ томас/, ' θομασ'],
	[/ тромб/, ' θρομμπ'],
	[/ трон/, ' θρον'],
	[/трамбоз/, 'θραμμποζ'],
	[/ тэадос/, ' θεαδοσ'],
	[/ тэарэм/, ' θεαρεμ'],
	[/ тэат(?=ар |р)/, ' θεατ'],
	[/ тэм(?=[аеуы])/, ' θεμ'],
	[/ тэ(?=[ао]р|салёнік|сал)/, ' θε'],
	[/тэ(?=с\S*алёнік|\S*зіс)/, 'θε'],
	[/тэрма/, 'θερμα'],
	[/ эт(?=ы[кч]|эр)/, ' εθ'],
];

// src/dict/arabic.ts
var soft = 'ْ(?=[еёіюяь])';
var presoft = '([تزكثࢮбвгджзйклмнпрстфхцчшў])ْ?(ّ?)';
var rawArabLetters = [
	[/ л[ая]/, ' لا'],
	[/л[ая]/, 'ـلا'],
	[/([бвгджзйклмнпрстфхцчшў]|д[зж])\1/, '$1ّ'],
	[/([бвгджзйклмнпрстфхцчшў])/, '$1ْ'],
	[/а/, 'اа'],
	[/ (?=[еэыуо])/, ' ا'],
	['дْз' + soft, 'ࢮ'],
	['з' + soft, 'ز'],
	['к' + soft, 'ك'],
	['с' + soft, 'ث'],
	['т' + soft, 'ت'],
	[/([تزكث])і/, 'ы'],
	[presoft + '[аяэе]', '$1$2َ'],
	[presoft + '[іы]', '$1$2ِ'],
	[/ і /, ' اِ '],
	[presoft + '[оёую]', '$1$2ُ'],
	[/ʼ/, 'ع'],
	[/ь/, ''],
	[/[яе]/, 'يَ'],
	[/і/, 'يِ'],
	[/[ёю]/, 'يُ'],
	[/[аэ]/, 'َ'],
	[/[ыі]/, 'ِ'],
	[/[оу]/, 'ُ'],
	[/б/, 'ب'],
	[/[вў]/, 'و'],
	[/г/, 'ه'],
	[/ґ/, 'غ'],
	[/дْж/, 'ج'],
	[/д/, 'د'],
	[/ж/, 'ژ'],
	[/з/, 'ض'],
	[/й/, 'ي'],
	[/к/, 'ق'],
	[/л/, 'ل'],
	[/м/, 'م'],
	[/н/, 'ن'],
	[/п/, 'پ'],
	[/р/, 'ر'],
	[/с/, 'ص'],
	[/т/, 'ط'],
	[/ф/, 'ف'],
	[/х/, 'ح'],
	[/ц/, 'ࢯ'],
	[/ч/, 'چ'],
	[/ш/, 'ش'],
	[/,/, '،'],
	[/\?/, '؟'],
];

// src/dict/arabic.t
var els1 = [];
els1[0] = 'сканд|ванад|рубід|род|ірыд|рэзэрфорд|';
els1[1] =
	'стронц|бар|цэр|лютэц|самар| тор|амэрыц|кальц|кюр|дармштат|лівэрмор|натр';
els1[2] = els1[1] + 'тэхнэц|прамэт|майтнэр|капэрніц';
els1[3] = els1[0] + 'паляд|' + els1[2];
var els2 = [];
els2[0] =
	'алюмін|магн|крэмн|цыркон|ніоб|рутэн|кадм|гафн|рэн|осм|эўроп|гандалін|тэрб|дыспроз|гольм| эрб|ітэрб|актын|пратактын|нэптун|плютон|фэрм|ляўрэнс|дубн|рэнтген|ніхон';
els2[1] = els2[0] + '|айнштайн|мендзялев|сыборг|гас|флеров';
var els3 = ' гал|бэрыл|тул|бэркл|набэл';
var toOneLine = (str) => str.replace(/\n/g, '|');
var ia = (word, words) =>
	` ${word} (?=\\(?(?:[бвгджзйклмнпстфцчшў]*[оё]|${words.replace(
		/\(/g,
		'(?:'
	)}|${iwords}))`;
var iwords = toOneLine(`і( 
біс
бсэн
в[аеоы] 
верс
вал[гз]
гар
грышч
грэк
дал
дыш
жыц
канапіс
кань?н
ка[цўл]
каў[кц]
ксі
леус
л(іст| )
лістас
льк
мант
мась?ц
мбры[кч]
менна 
мідж
мпар[тц]
мпульс[аеуы]
нахадз
нды([ійюя] |ев)
ндэкс(а(ў|мі?)? |[еуыі])
н[еі][ейяю]
нк([аіу])
нтэрым
нфікс
нфімум
ншась?ц
нш(а[йя]?|ую|ы(мі|х|я)?) 
псілан
рад
рбіс
рмас
рха
рыс 
скарк
скарак
скра
скравец
скрачк
с[нт]ась?ц
сь?цік
сь?цін
тар
тры
ць?він
шыяс)`);
var rawWordlist = [
	[/аахен/, 'аахэн'],
	[/абанен(?=[тц])/, 'абанэн'],
	[/абанемен(?=[тц])/, 'абанэмэн'],
	[/ абвер(?=а[мў]? |[ыу] | )/, ' абвэр'],
	[/ абера(?=[тц])/, ' абэра'],
	[/абісін/, 'абісын'],
	[/абрахам/, 'абрагам'],
	[/абсент/, 'абсэнт'],
	[/абстынен(?=[тц])/, 'абстынэн'],
	[/абеліск/, 'абэліск'],
	[/аванбек/, 'аванбэк'],
	[/авест/, 'авэст'],
	[/ аверс/, ' авэрс'],
	[/авеню/, 'авэню'],
	[/авераізм/, 'авэраізм'],
	[/авераэс/, 'авэраэс'],
	[/аверон/, 'авэрон'],
	[/ агая /, ' агаё '],
	[/ агасцін/, ' агастын'],
	[/адвек(?=[тц])/, 'адвэк'],
	[/адвент/, 'адвэнт'],
	[/адверб/, 'адвэрб'],
	[/адрэнаміметы/, 'адрэнамімэты'],
	[/азерб/, 'азэрб'],
	[/ азен/, ' азэн'],
	[/эйншэйн(?:ій)?/, 'айнштайн'],
	[/петальн/, 'пэтальн'],
	[/ аксел/, ' аксэл'],
	[/аксера/, 'аксэра'],
	[/фенамід/, 'фэнамід'],
	[/аксесуар/, 'аксэсуар'],
	[/акцёр/, 'актор'],
	[/актрыса/, 'акторка'],
	[/актынел/, 'актынэл'],
	[/ алах/, ' ал�аг'],
	[/албан/, 'альбан'],
	[/альвеола/, 'альвэоля'],
	[/альвеолы/, 'альвэолі'],
	[/альвеолу/, 'альвэолю'],
	[/альвеол/, 'альвэол'],
	[/алг(?=арытм|ебр)/, 'альг'],
	[/алжыр/, 'альжыр'],
	[/алка(?=г[ао]|ло)/, 'алька'],
	[/алфавіт/, 'альфабэт'],
	[/алхім/, 'альхім'],
	[/ альцгеймер/, ' альцгаймэр'],
	[/амбулатор/, 'амбулятор'],
	[/амплуа/, 'амплюа'],
	[/мсціла/, 'амсьцісла'],
	[/аме(?=ры[кц])/, 'амэ'],
	[/анапест/, 'анапэст'],
	[/англія/, 'анґ(лія|ельшчына)'],
	[/англіі/, 'анґ(ліі|ельшчыны|ельшчыне)'],
	[/англію/, 'анґ(лію|ельшчыну)'],
	[/англій /, 'анґ(лій|ельшчын|ельшчынаў) '],
	[/англійск/, 'анґ(лій|ель)ск'],
	[/антарыа /, 'антарыё '],
	[/ане(?=стэ[зт])/, 'анэ'],
	[/апазіцы/, 'апазыцы'],
	[/апалагет/, 'апаляґет'],
	[/ апафе(?=оз|аты|м)/, ' апатэ'],
	[/апсід/, 'апсыд'],
	[/апельсін/, 'апэльсін'],
	[/апеляцы/, 'апэляцы'],
	[/апера(?=[втц])/, 'апэра'],
	[/аперу(?=[ею])/, 'апэру'],
	[/ араві(?=[юійя])/, ' арабі'],
	[/араме(?=[еійя])/, 'арамэ'],
	[/аргенцін/, 'арґентын'],
	[/аргумен/, 'арґумэн'],
	[/арсенал/, 'арсэнал'],
	[/арфа(гра[мф]|эп)/, 'арта$1'],
	[/архіпелаг/, 'архіпэляг'],
	[/арыстоцел/, 'арыстотэл'],
	[/арыфмет/, 'арытмэт'],
	[/аспект/, 'аспэкт'],
	[/атлант/, 'атлянт'],
	[/атлас/, 'атляс'],
	[/ афін/, ' атэн'],
	[/афган/, 'а(ў|ф)ган'],
	[/вавілон/, 'бабілён'],
	[/ бабенберг/, ' бабэнбэрґ'],
	[/багг(?=[аі])/, 'баг'],
	[/базілік/, 'базылік'],
	[/ бакач/, ' бакачч'],
	[/бакінгем/, 'бэккінґгэм'],
	[/ балонья/, ' балёньня'],
	[/ балон/, ' балён'],
	[/балкон /, 'балькон '],
	[/балкон/, 'балькон'],
	[/бала(?=д|нс)/, 'баля'],
	[/бангладэш/, 'банглядэш'],
	[/варвар/, 'барбар'],
	[/барселон/, 'барсэлён'],
	[/басейн/, 'басэйн'],
	[/ баторый /, ' баторы '],
	[/ баторыя /, ' баторага '],
	[/ баторыяў /, ' баторых '],
	[/балгар/, 'баўгар'],
	[/брэст /, '(брэст|берасьце) '],
	[/брэста/, '($&|берасьця)'],
	[/\(брэста\|берасьця\)м/, '(брэста|берасьце)м'],
	[/брэсту/, '($&|берасьцю)'],
	[/брэсце/, '($&|берасьці)'],
	[/брэсцк/, '($&|берасьцейск)'],
	[/бест/, 'бэст'],
	[/візант/, 'бізант'],
	[/бізнес/, 'бізнэс'],
	[/[ея]піскап/, '(япіска|біску)п'],
	[/(бі|тры)ятлон/, '$1ятлён'],
	[/алякс(\S+) блёк/, 'алякс$1 блок'],
	[/блуз/, 'блюз'],
	[/блакад/, 'блякад'],
	[/блёнд/, 'блонд'],
	[/бланк/, 'блянк'],
	[/бразіл/, 'бразыл'],
	[/бруне/, 'брунэ'],
	[/брусел/, 'брусэл'],
	[/брыганціна/, 'брыгантына'],
	[/ брысбен/, ' брысбэйн'],
	[/будапеш/, 'будапэш'],
	[/бульдозер/, 'бульдозэр'],
	[/бундэсвер/, 'бундэсвэр'],
	[/буфер/, 'буфэр'],
	[/бухгалт/, 'бухгальт'],
	[/беліз/, 'бэліз'],
	[/бельг/, 'бэльґ'],
	[/бенгал/, 'бэнгал'],
	[/бензін/, 'бэнзін'],
	[/бенін/, 'бэнін'],
	[/бенедыкт /, 'бэнэдыкт '],
	[/бэрге(?=лі|ля)/, 'бер�ге'],
	[/берг/, 'бэрґ'],
	[/ бёрдслі /, ' бэрдсьлі '],
	[/берклі/, 'бэрклі'],
	[/берлін/, 'бэрлін'],
	[/бермуд/, 'бэрмуд'],
	[/ бернардзін/, ' бэрнардын'],
	[/ берн/, ' бэрн'],
	[/ бэрн([ія]) /, ' берн$1 '],
	[/ бэрнік/, ' бернік'],
	[/ бэрнатоў/, ' бернатоў'],
	[/віфлеем/, 'бэтлеем'],
	[/беразіно /, '(беразіно|бярэзань) '],
	[/беразі(н[ае]) /, '(беразі$1|бярэзані) '],
	[/беразіном /, '(беразіном|бярэзаньню) '],
	[/ бягомль/, ' (бягомель|бегамля)'],
	[/ вайбер/, ' вайбэр'],
	[/вейшнор/, 'вайшнор'],
	[/валанцёр/, 'валянтэр'],
	[/ валон/, ' валён'],
	[/ валенсі/, ' вален�сі'],
	[/ валенс/, ' валэнс'],
	[/валуа/, 'валюа'],
	[/ватэрлоа/, 'ватэрлёо'],
	[/ верон/, ' вэрон'],
	[/вʼетнам/, 'віетнам'],
	[/візіт/, 'візыт'],
	[/вінсент/, 'він(с|ц)энт'],
	[/ орш/, ' (о|во)рш'],
	[/венгрыя/, '(вэнґрыя|вугоршчына|мадзяршчына)'],
	[/венгрыі/, '(вэнґрыі|вугоршчыны|вугоршчыне|мадзяршчыны|мадзяршчыне)'],
	[/венгрый/, '(вэнґрый|вугоршчын|вугоршчынаў|мадзяршчын|мадзяршчынаў)'],
	[/венгер/, '(вэнґе|вуго|мадзя)р'],
	[/венгр /, '(вэнґр|вугорац|мадзяр) '],
	[/венгр/, '(вэнґр|вугорц|мадзяр)'],
	[/венгры/, '(вэнґры|вугорцы|мадзяры)'],
	[/венграм/, '(вэнґрам|вугорцам|мадзярам)'],
	[/вегета/, 'вэґета'],
	[/вектар/, 'вэктар'],
	[/вэксал/, 'вэксэл'],
	[/веласіпе/, 'вэлясыпэ'],
	[/веласі/, 'вэлясы'],
	[/вела(?=[дзкмрпс])/, 'вэля'],
	[/вентыл/, 'вэнтыл'],
	[/венер/, 'вэнэр'],
	[/венесуэл/, 'вэнэсуэл'],
	[/вермахт/, 'вэрмахт'],
	[/вер(?=сі|нісаж|сал|тыкал|ф(і|ей|ʼю|я[мхў]|ямі)? )/, 'вэр'],
	[/вестфал/, 'вэстфал'],
	[/ вестра/, ' вэстра'],
	[/вестэр/, 'вэстэр'],
	[/ветэран/, 'вэтэран'],
	[/ветэрынар/, 'вэтэрынар'],
	[/ вілей/, ' (ві|вя)лей'],
	[/ в(орана|арано)ва /, ' (в$1ва|вярэнаў) '],
	[/в(?:орана|арано)(ва|ў)/, '($&|вярэна$1)'],
	[/в(?:орана|арано)ве/, '($&|вярэнаве)'],
	[/ яўрэ/, ' габрэ'],
	[/ хадсан/, ' гадсан'],
	[/газе(?=[лтц])/, 'газэ'],
	[/генрых(\S*) (?=гімлер|гайнэ|бёль|гэрц|любке|фон|шліман)/, 'гайнрых$1 '],
	[/халакос/, 'галакос'],
	[/галапагас/, 'ґаляпаґас'],
	[/ гал[ую]а /, ' ґалюа '],
	[/гала(?=кт|г|ц)/, 'галя'],
	[/ хард/, ' гард'],
	[/гвадэлуп/, 'ґвадэлюп'],
	[/гвіне/, 'ґвінэ'],
	[/гебельс/, 'ґёбэльс'],
	[/гейзэр/, 'ґейзер'],
	[/ле[гґ]ендар/, 'леґен�дар'],
	[/гендар/, 'ґенд(э|а)р'],
	[/генера(?=[тц])/, 'ґенэра'],
	[/ гене/, ' ґенэ'],
	[/генез/, 'ґенэз'],
	[/іера(?=рх|тычн)/, 'г�ера'],
	[/гер(?=о[ійю] |о[ея]|аі)/, '(гэ|г�е)р'],
	[/гібралтар/, 'ґібральтар'],
	[/хіджра/, 'гіджра'],
	[/хіндзі/, 'гіндзі'],
	[/гінек/, 'гінэк'],
	[/ гірландая /, ' гірлянда(я|ё) '],
	[/хіт - парад/, 'гіт - парад'],
	[/іспан/, 'гішпан'],
	[/глобус/, 'глёбус'],
	[/ глота(?=льн|ген)/, ' глёта'],
	[/глабал/, 'ґлябал'],
	[/глады(?=ёлюс|ятар)/, 'гляды'],
	[/глазур/, 'глязур'],
	[/(глін|пар)твейн/, '$1твайн'],
	[/ года /, ' году '],
	[/ холмс(?=[аеуы])/, ' голмз'],
	[/гольштэйн/, 'гальштайн'],
	[/([іы]) горад /, '($1|ае) (горад|места) '],
	[/ горад /, ' (горад|места) '],
	[/ гораду/, ' (гораду|месту|места)'],
	[/ горада/, ' (горад|мест)а'],
	[/ горадзе /, ' (горадз|месьц)е '],
	[/ гарадоў /, ' (гарадо|места)ў '],
	[/ гарадскі/, ' (гарадзкі|меставы)'],
	[/ гарадск/, ' (гарадзк|местав)'],
	[/ гарад/, ' (гарад|мест)'],
	[/гродна /, '(гродна|горадня) '],
	[/гродне/, '($&|горадні)'],
	[/гродзен/, '($&|гарадзен)'],
	[/хоспіс/, 'госьпіс'],
	[/графі(?=[кч])/, 'ґрафі'],
	[/грэчас/, 'грэц'],
	[/гу([бв])ернёр/, 'гу$1эрнэр'],
	[/гу([бв])ерн/, 'гу$1эрн'],
	[/ хэві /, ' гэві '],
	[/гудвін/, 'ґудвўін'],
	[/хэдлайнер/, 'гэдлайнэр'],
	[/хэлаўін/, 'гэлаўін'],
	[/хэмінгуэй/, 'гэмінгўэй'],
	[/хэмпшыр/, 'гэмпшыр'],
	[/ генрых/, ' г(э|ай)нрых'],
	[/генры|хенры/, 'гэнры'],
	[/ герб/, ' г(е|э)рб'],
	[/герц(?= |аг)/, 'гэрц'],
	[/гесэн/, 'гэсэн'],
	[/хэштэг/, 'гэштэґ'],
	[/ гюго /, ' юґо '],
	[/хʼюстан/, 'гʼюстан'],
	[/ (да(?:дзе)?ныя) /, ' ($1|зьвесткі) '],
	[/ (да(?:дзе)?ных) /, ' ($1|зьвестак|зьвестках) '],
	[/ (да(?:дзе)?ным)(?=і? )/, ' ($1|зьвесткам)'],
	[/джыхад/, 'джыгад'],
	[/ джэймс/, ' джэймз'],
	[/джэрсі/, 'джэрзі'],
	[/джэсік/, 'джэсык'],
	[/дзмітрый/, 'дзьмітры'],
	[/ы верхнядзвінск /, '(ы|ая|ую) (верхнядзьвінск|дрыса|дрысу) '],
	[/([іы]м) верхнядзвінскам/, '($1|ай) (верхнядзьвінскам|дрысай)'],
	[/(ага|[іы]м) верхнядзвінску/, '($1|ай) (верхнядзьвінску|дрысе)'],
	[/ага верхнядзвінска/, '(ага|ай) (верхнядзьвінску|дрысы)'],
	[/ верхнядзвінск /, ' (верхнядзьвінск|дрыса|дрысу) '],
	[/ верхнядзвінска /, ' (верхнядзьвінску|дрысы) '],
	[/ верхнядзвінску /, ' (верхнядзьвінску|дрысе) '],
	[/ верхнядзвінск/, ' (верхнядзьвін|дрысаў)ск'],
	[/дзюсельдорф/, 'дусэльдорф'],
	[/дыверсан/, 'дывэрсан'],
	[/дывертысмен/, 'дывэртысмэн'],
	[/дызель/, 'дызэль'],
	[/дыплом/, 'дыплём'],
	[/дыпламат/, 'дыплямат'],
	[/дырыжор/, 'дырыґент'],
	[/дысер(?=[тц])/, 'дысэр'],
	[/ дысне/, ' дыснэ'],
	[/дыябет/, 'дыябэт'],
	[/дэбет/, 'дэбэт'],
	[/дэзерцір/, 'дэзэртэр'],
	[/дэклар/, 'дэкляр'],
	[/дэфект/, 'дэфэкт'],
	[/дʼявал(?=[ ь])/, 'дʼябал'],
	[/дʼявал/, 'дʼябл'],
	[/емен/, 'емэн'],
	[/еўгені(?=[кч])/, 'эўґені'],
	[/еўнух/, 'эўнух'],
	[/іо(зэ|сі)ф/, 'ё$1ф'],
	[/іаганес/, 'яганэс'],
	[/іаган/, 'ёган'],
	[/ае жодзіна /, '(ае|ы|і) жодзі(на|н) '],
	[/жодзіна /, 'жодзі(на|н|не) '],
	[/жэнев/, 'жэнэв'],
	[/ заблак/, ' забляк'],
	[/завербава/, 'завэрбава'],
	[/ акісл/, ' затлян'],
	[/зімбаб/, 'зымбаб'],
	[/ае дзятлава /, '(ае|ы) (дзятлава|зьдзецел) '],
	[/ дзятлава /, ' (дзятлава|зьдзецел) '],
	[/ дзятлаве/, ' (дзятлаве|зьдзецеле)'],
	[/ дзятлава/, ' (дзятлава|зьдзецела)'],
	[/ дзятлаўск/, ' (дзятлаў|зьдзецель)ск'],
	[/зеланд/, 'зэлянд'],
	[/іванав(?=[ае])/, '(іва|я)нав'],
	[/\(іва\|я\)нава /, '(іванава|янаў|янава) '],
	[/іванаўск/, '(іва|я)наўск'],
	[/іерэ(?=[йю] |[ея])/, '(г�е|я)рэ'],
	[/інвентар/, 'інвэнтар'],
	[/інвест/, 'інвэст'],
	[/інданез/, 'інданэз'],
	[/інквізы/, 'інквізі'],
	[/інспек/, 'інспэк'],
	[/інтэрвʼю/, 'інтэрвію'],
	[/кабель/, 'кабэль'],
	[/кабінет/, 'кабінэт'],
	[/казеін/, 'казэін'],
	[/калінкавіч/, 'каленкавіч'],
	[/калон/, 'калён'],
	[/калоід/, 'калёід'],
	[/калоквіум/, 'калёквіюм'],
	[/калоры/, 'калёры'],
	[/калары/, 'каляры'],
	[/калумб/, 'калюмб'],
	[/кала(?=бар|ні[зс]|пс)/, 'каля'],
	[/каменд/, 'камэнд'],
	[/камен(?:т|цір)/, 'камэнт'],
	[/((?:ка|парля)мэнт|сцэн)арый/, '$1ар'],
	[/((?:ка|парля)мэнт|сцэн)арыі/, '$1ары'],
	[/((?:ка|парля)мэнт|сцэн)арыяў/, '$1ароў'],
	[/((?:ка|парля)мэнт|сцэн)арыя/, '$1ара'],
	[/кампазі/, 'кампазы'],
	[/кампанен/, 'кампанэн'],
	[/кампʼют/, 'кампут'],
	[/кампе(?=нса|тэн)/, 'кампэ'],
	[/канве(?=[нр])/, 'канвэ'],
	[/кансерв/, 'кансэрв'],
	[/канспект/, 'канспэкт'],
	[/кантынент/, 'кантынэнт'],
	[/канфэрен/, 'канфэрэн'],
	[/канфес/, 'канфэс'],
	[/(канфі|мінія)цюр/, '$1тур'],
	[/каплан/, 'кап�лан'],
	[/кап[еэ]лан/, 'капэ�лан'],
	[/кап[еэ]ла/, 'капэля'],
	[/каперні([кц])(?:ый)?/, 'капэрні$1'],
	[/карамель/, 'карамэль'],
	[/ карнуол/, ' карнўол'],
	[/карфаген/, 'картаґен'],
	[/касет/, 'касэт'],
	[/касмет/, 'касмэт'],
	[/катала/, 'каталя'],
	[/ кафедр /, ' катэд(ар|раў) '],
	[/кафедр/, 'катэдр'],
	[/кхмер/, 'кгмэр'],
	[/(кентэр|сад)беры/, '$1бэры'],
	[/кербела/, 'кербэля'],
	[/кербелы/, 'кербэлі'],
	[/кербелс/, 'кербэльс'],
	[/кербеле/, 'кербэле'],
	[/кіла/, 'кіля'],
	[/ п[ао]ўкіло /, ' паўкілі '],
	[/ ([кс])інема/, ' $1інэма'],
	[/клаві/, 'кляві'],
	[/клас[ыі]/, 'клясы'],
	[/ы клас /, 'ая кляса '],
	[/[іы]м класе /, 'ай клясе '],
	[/[іы]м класам /, 'ай клясай '],
	[/ага класа /, 'ай клясы '],
	[/му класу /, 'й клясе '],
	[/класам /, 'клясай '],
	[/класа /, 'клясы '],
	[/класу /, 'клясе '],
	[/клас(?=[аену])/, 'кляс'],
	[/ клас /, ' кляса '],
	[/клубн/, 'клу�бн'],
	[/клу(м?)б/, 'клю$1б'],
	[/кобрын /, 'кобры(н|нь) '],
	[/кобрына /, 'кобры(на|ня) '],
	[/кобрынам/, 'кобры(на|не)м'],
	[/кобры(н[еу]) /, 'кобры($1|ні) '],
	[/дзяржынск /, '(дзяржынск|койданаў) '],
	[/дзяржынска /, '(дзяржынска|койданава) '],
	[/дзяржынску/, '($&|койданаве|койданава)'],
	[/ае косава /, '(ае|ы|і) коса(ва|ў) '],
	[/ косава /, ' коса(ва|ў) '],
	[/ краснінск/, ' крась(ні|ня)нск'],
	[/ кратар/, ' кратэр'],
	[/ксіла/, 'ксыля'],
	[/кувей/, 'кувэй'],
	[/кузен/, 'кузэн'],
	[/ квінсленд/, ' к(ў|в)інзлэнд'],
	[/ кві(?=н |дыч)/, ' к(ў|в)ін'],
	[/кемпінг/, 'кэмпінг'],
	[/кельвін/, 'кэльвін'],
	[/кельнер/, 'кэльнэр'],
	[/кювет/, 'кювэт'],
	[/(лад|ка)зімір/, '$1зім(і|е)р'],
	[/левіяфан/, 'левіятан'],
	[/лексіка/, 'лексыка'],
	[/лейкапла/, 'леўкапля'],
	[/лейкацы/, 'леўкацы'],
	[/ (ма|(?:ня)?[уў]да)лога /, ' $1л�ога '],
	[/([ая])лог(?=(?:у|ам?|і[іюя]?|іяй)? )/, '$1лёг'],
	[/лог(?=ік[аіу]? |ікай |іцы )/, 'лёг'],
	[/ (тры|ды)логі/, ' $1лёгі'],
	[/ полаг/, ' пол�аг'],
	[/алаг(?=(?:у|а[мў]?|і)? |ем|іч|ізм)/, 'аляг'],
	[/олаг(?=(?:у|а[мў]?|і)? )/, 'оляг'],
	[/лоджыя/, 'лёджыя'],
	[/лозунг/, 'лёзунг'],
	[/ ложа /, ' лёжа '],
	[/лоід(?=\S?\S?і? )/, 'лёід'],
	[/лондан/, 'лёндан'],
	[/ лі([бв])ер/, ' лі$1эр'],
	[/ ліван(?=[ кс])/, ' лібан'],
	[/ ліві(?=[йюя] |й[сц ])/, ' лібі'],
	[/літвін/, 'ліцьвін'],
	[/ліхтэнштэйн/, 'ліхтэнштайн'],
	[/ ленд(?=лорд|ледзі)/, ' лэнд'],
	[/ленд /, 'лэнд '],
	[/калэнд/, 'календ'],
	[/люксем/, 'люксэм'],
	[/ луі/, ' люі'],
	[/лунаці/, 'люнаты'],
	[/люнебур/, 'люнэбур'],
	[/лучч?ы /, 'люччы '],
	[/ луўр/, ' люўр'],
	[/лабара(?=[нт])/, 'лябара'],
	[/лабірын(?=[тц])/, 'лябірын'],
	[/лабатам/, 'лябатам'],
	[/лаванд/, 'ляванд'],
	[/лагарыф/, 'лягарыт'],
	[/лагатып/, 'лягатып'],
	[/лагуна/, 'лягуна'],
	[/лейпцыг/, 'ляйпцыг'],
	[/лейтматы/, 'ляйтматы'],
	[/ лака(?=дыўск|й?л|маты|н|та|цы)/, ' ляка'],
	[/ лакснэс/, ' лякснэс'],
	[/ лакт(?=[аоу])/, ' лякт'],
	[/лакуна/, 'лякуна'],
	[/ламп/, 'лямп'],
	[/ ланда[уў] /, ' ла�ндаў '],
	[/ ландыш/, ' ла�ндыш'],
	[/ холанд/, ' гола�нд'],
	[/ буландын/, ' була�ндын'],
	[/ланд/, 'лянд'],
	[/лантан/, 'лянтан'],
	[/лапланд/, 'ляплянд'],
	[/ларынг/, 'лярынг'],
	[/ларэ(?=н|та)/, 'лярэ'],
	[/ласьён/, 'лясьён'],
	[/ залатарэн/, ' зала�тарэн'],
	[/латар(?=[ыэ])/, 'лятар'],
	[/лаўр(?=о|ыша|энц)/, 'ла�ўр'],
	[/лаўр/, 'ляўр'],
	[/лафет/, 'ляфэт'],
	[/ лаял(?=[ьі])/, ' ляял'],
	[/махабхарата/, 'магабгарата'],
	[/мадмуазел/, 'мадмуазэл'],
	[/максім(?=ал|ум)/, 'максым'],
	[/максвел/, 'максвэл'],
	[/макулатур/, 'макулятур'],
	[/маладзечн/, 'маладэчн'],
	[/мангейм/, 'мангайм'],
	[/манхэтан/, 'мангэтан'],
	[/ май(?=ск| )/, ' (май|травень)'],
	[/ маі /, ' (маі|траўні) '],
	[/мантсер/, 'мансэр'],
	[/манет/, 'манэт'],
	[/карт(?=[аоуы])/, '($&|мап)'],
	[/карце /, '(карце|мапе) '],
	[/карт /, '(карт|мап|картаў|мапаў) '],
	[/марафон/, 'маратон'],
	[/марцінке/, 'марці�нке'],
	[/марцінес/, 'мартынэс'],
	[/марцін/, 'мартын'],
	[/масажор/, 'масаж(ор|нік)'],
	[/ майя /, ' мая '],
	[/ ме[зс]аамеры/, ' мэ(з|с)аамэры'],
	[/мікранез/, 'мікранэз'],
	[/ міксер/, ' міксэр'],
	[/міліцыянер/, 'міліцыян(эр|т)'],
	[/мінерал/, 'мінэрал'],
	[/ мінск/, ' (мі|ме)нск'],
	[/ міфіч/, ' мітыч'],
	[/ міфе /, ' міце '],
	[/ міф/, ' міт'],
	[/ (арф|гайв|каліз|муз|спідв)е([ійюя])/, ' $1э$2'],
	[/ (арф|гайв|каліз|муз|спідв)еем/, ' $1эем'],
	[/ (арф|гайв|каліз|муз|спідв)ее/, ' $1эі'],
	[/ (арф|гайв|каліз|муз|спідв)е/, ' $1э'],
	[/маджахед/, 'муджаг�ед'],
	[/магамед/, 'мухамад'],
	[/медал/, 'мэдал'],
	[/мед(?=ы|бра[тц]|с[ёя]с[тц]|інстыт)/, 'мэд'],
	[/медзі(?=\S)/, 'мэды'],
	[/ меза/, ' мэза'],
	[/мексі(?=[кц])/, 'мэксы'],
	[/ мекк/, ' мэк'],
	[/мела(?=драм|нізм|ном|рэн|танін|ні[нт]|нхол)/, 'мэля'],
	[/меліяра/, 'мэліяра'],
	[/мелоды/, 'мэлёды'],
	[/мелады/, 'мэляды'],
	[/мемар(?=андум|ыял)/, 'мэмар'],
	[/менедж/, 'мэнэдж'],
	[/менестрэл/, 'мэнэстрэл'],
	[/ меню/, ' мэню'],
	[/меркел/, 'мэркел'],
	[/меркур(?:ый)?/, 'мэркур'],
	[/м[еэ]с[еэ]ндж[аэ]р/, 'мэсэндж(э|а)р'],
	[/ металур/, ' мэталюр'],
	[/ мета/, ' мэта'],
	[/сіметры/, 'сымэтры'],
	[/метр(?=[аоуы ])/, 'мэтр'],
	[/метэа(?=[нрс])/, 'мэтэа'],
	[/метэор/, 'мэтэор'],
	[/механ/, 'мэхан'],
	[/мецэна(?=[тц])/, 'мэцэна'],
	[/мюнхен/, 'мюнхэн'],
	[/ мячэць /, ' мячэт '],
	[/ мячэці/, ' мячэ(та|ту|ты|це)'],
	[/ мячэццю/, ' мячэтам'],
	[/ мячэц[ея]/, ' мячэта'],
	[/навагруд/, 'наваград'],
	[/нав[еэ]ла/, 'навэля'],
	[/ назвай /, ' наз(вай|овам) '],
	[/ назвамі /, ' на(зв|зов)амі '],
	[/ назв([ау]) /, ' наз(в$1|оў) '],
	[/ назве /, ' на(зьве|зову) '],
	[/ назвы /, ' наз(вы|ова|овы) '],
	[/накцюрн/, 'нактурн'],
	[/ нараджэнн(ем|ямі) /, ' нар(аджэньн$1|одзінамі) '],
	[/ нараджэнне /, ' нар(аджэньне|одзіны) '],
	[/ нараджэння(ў?) /, ' нар(аджэньня$1|одзінаў) '],
	[/ нараджэнні /, ' нар(аджэньні|одзінах) '],
	[/ нараджэнню /, ' нар(аджэньню|одзінам) '],
	[/нарве/, 'нарвэ'],
	[/натарыўс/, 'натарыюс'],
	[/нацюрморт/, 'натурморт'],
	[/ніверсал/, 'нівэрсал'],
	[/ніверсітэ/, 'нівэрсытэ'],
	[/нобел/, 'нобэл'],
	[/нашвіл/, 'нэшвіл'],
	[/негр(?=ы[тц ]|оід|а?ў? )/, 'нэґр'],
	[/негаты/, 'нэґаты'],
	[/нейтрал/, 'нэўтрал'],
	[/неўра/, 'нэўра'],
	[/ней(т?)рон/, 'нэў$1рон'],
	[/некраш/, 'не�краш'],
	[/некра/, 'нэкра'],
	[/нэкранут/, 'некранут'],
	[/ неп(ал|тун)/, ' нэп$1'],
	[/ нэпаладк/, ' непаладк'],
	[/нерв/, 'нэрв'],
	[/германія/, '($&|нямеччына)'],
	[/германіі/, '($&|нямеччыны|нямеччыне)'],
	[/германію/, '($&|нямеччыну)'],
	[/непісьмен/, 'няпісьмен'],
	[/ авер(?=арм|драйв|драфт|дро|лок|лорд|солд|тайм|тон|штаг)/, ' овэр'],
	[/ эйлер/, ' ойлер'],
	[/ опер(?=[ауы])/, ' опэр'],
	[/ осла/, ' осьлё'],
	[/павел/, 'павал'],
	[/павалічэн/, 'павелічэн'],
	[/падпісчыкі/, 'падпісанты'],
	[/падпісчык/, 'падпісант'],
	[/пазі(?=цы|т)/, 'пазы'],
	[/палесцін/, 'палестын'],
	[/палінез/, 'палінэз'],
	[/ палані(?=[клў])/, ' па�лані'],
	[/палоні/, 'палёні'],
	[/палані/, 'паляні'],
	[/паланэз/, 'палянэз'],
	[/пампе(?=[ійя])/, 'пампэ'],
	[/партфел/, 'партфэл'],
	[/пафас/, 'патас'],
	[/пудзел/, 'пудэл'],
	[/пуэрта/, 'пўэрта'],
	[/пед /, 'пэд '],
	[/падынгтан/, 'пэдынґтан'],
	[/педа(?=[глф])/, 'пэда'],
	[/педы/, 'пэды'],
	[/пенальці/, 'пэнальці'],
	[/ пені/, ' пэні'],
	[/ пэнікі/, ' пенікі'],
	[/пенсіл/, 'пэнсыл'],
	[/пенсі/, 'пэнсі'],
	[/пейзаж/, 'пэйзаж'],
	[/ пергам/, ' пэргам'],
	[/перпендыкуляр/, 'пэрпэндыкуляр'],
	[/перс([ао])н/, 'пэрс$1н'],
	[/перспекты/, 'пэрспэкты'],
	[/персі(?=[ійя])/, 'пэрсі'],
	[/персід/, 'пэрсыд'],
	[/ перу/, ' пэру'],
	[/перыяд/, 'пэрыяд'],
	[/ песа /, ' пэса '],
	[/песімі(?=[зс])/, 'пэсымі'],
	[/пламбір/, 'плямбір'],
	[/плантагене/, 'пл�антаґенэ'],
	[/плане(?=[тц])/, 'плянэ'],
	[/(\S)пласт/, '$1пляст'],
	[/пластыр/, 'плястар'],
	[/пласты/, 'плясты'],
	[/платона(?=[ўв])/, 'пла�тона'],
	[/плато/, 'плято'],
	[/платформ/, 'плятформ'],
	[/ плац(?=[аоуык])/, ' пляц'],
	[/пла(?=н|кат|фон|тформ|сты([кч]))/, 'пля'],
	[/плашк/, 'пляшк'],
	[/плутон/, 'плютон'],
	[/(\S{3})([ыі]) пол /, '$1($2|ая) (пол|плоць) '],
	[/(\S{3})([ыі]м) полам /, '$1($2|ай) (полам|плоцьцю) '],
	[/(\S{3})(а(?:га|му)) (пол[ау]) /, '$1($2|ай) ($3|плоці) '],
	[/ пол /, ' (пол|плоць) '],
	[/ полам /, ' (полам|плоцьцю) '],
	[/ (пол[ау]) /, ' ($1|плоці) '],
	[/ палав(?=[ауы])/, ' (палав|плоцев)'],
	[/(пола|слу)цк /, '$1цак '],
	[/слаўгарадзе /, '(слаў�гарадзе|прапойску) '],
	[/слаўгарадскі/, '(слаў�гарадзк|прапойск)і'],
	[/слаўгарад/, '(слаўгарад|прапойск)'],
	[/прайснер/, 'прайснэр'],
	[/прафес(?=[аіу])/, 'прафэс'],
	[/прафілакт/, 'прафілякт'],
	[/прынсіпі/, 'прынсыпі'],
	[/прэзід/, 'прэзыд'],
	[/псеўда/, 'псэўда'],
	[/псіх(?=[аіо])/, 'псых'],
	[/пілот/, 'пілёт'],
	[/пілата(?=[вж])/, 'пілята'],
	[/піфагор/, 'пітагор'],
	[/рэйх/, 'райх'],
	[/расі(?=[ійюя] |йс)/, 'ра(сі|се)'],
	[/роберт/, 'робэрт'],
	[/ рузвельт/, ' рузвэлт'],
	[/ розав/, ' ружов'],
	[/рыа - дэ - жанейра/, 'рыю - дэ - жанэйру'],
	[/ ры[ао] -/, ' рыю -'],
	[/рэверс/, 'рэвэрс'],
	[/рэгламе/, 'рэглямэ'],
	[/рэзерв/, 'рэзэрв'],
	[/рэзерфорд(?:ый)?/, 'рэзэрфорд'],
	[/рэзідэн/, 'рэзыдэн'],
	[/ рэйн(?= |лянд)/, ' райн'],
	[/рэкаменд/, 'рэкамэнд'],
	[/рэклам/, 'рэклям'],
	[/рэмейк/, 'рэмэйк'],
	[/сакрысці/, 'сакрысты'],
	[/салон/, 'салён'],
	[/ самер/, ' самэр'],
	[/ санет/, ' санэт'],
	[/сарбент/, 'сарбэнт'],
	[/ свен(?=(?:[аеуы]|амі?|аў|ав(ы|[аы]я))? )/, ' свэн'],
	[/ свердруп/, ' свэрдруп'],
	[/ солсберы /, ' солсбэры '],
	[/ соус/, ' соўс'],
	[/свазілэ/, 'сўазілэ'],
	[/сві(?=нг|фт)/, 'сўі'],
	[/свят(\S+) ален(\S\S?)/, 'сьвят$1 гэлен$2'],
	[/свяшчэнн/, 'сьвят'],
	[/сцефанполлеўск/, 'сь(цефанпольлеў|цяфанпаль)ск'],
	[/ сцефанполле /, ' сь(цефанпольле|цяфанпаль) '],
	[/ сцефанполл/, ' сь(цефанпольл|цяфанпал)'],
	[/сеанс/, 'сэанс'],
	[/ себарэ/, ' сэбарэ'],
	[/себасц[іь]ян/, 'сэбастыян'],
	[/ севиль(?=[еіюя])/, ' сэвильл'],
	[/ севиль/, ' сэвиль'],
	[/сезон/, 'сэзон'],
	[/сейшэл/, 'сэйшэл'],
	[/сексцін/, 'сэкстын'],
	[/сек(?=[ст]|цы)/, 'сэк'],
	[/секунд/, 'сэкунд'],
	[/ селек(?=[тц])/, ' сэлек'],
	[/семант/, 'сэмант'],
	[/семі(?=т|ц|нар)/, 'сэмі'],
	[/семестр/, 'сэмэстр'],
	[/сэмюал/, 'сэмʼюэл'],
	[/ сен - люі /, ' сэн - люі '],
	[/сена(?=[тц])/, 'сэна'],
	[/сенегал/, 'сэнэгал'],
	[/сенсац/, 'сэнсац'],
	[/сентымен/, 'сэнтымэн'],
	[/ сент /, ' сэнт '],
	[/серб/, 'сэрб'],
	[/серве/, 'сэрвэ'],
	[/серв(?=а|іс)/, 'сэрв'],
	[/серыя/, 'сэрыя'],
	[/ сёрфі/, ' сэрфі'],
	[/сесі(?=[ія])/, 'сэсі'],
	[/сідней/, 'сыднэй'],
	[/сінгуляр/, 'сынгуляр'],
	[/сіетл/, 'сіэтл'],
	[/сілез/, 'сылез'],
	[/ сіан/, ' сіян'],
	[/сібір/, 'сыбір'],
	[/сіб([ао])рг(?:ій)?/, 'сыб$1рг'],
	[/сігнал/, 'сыгнал'],
	[/сілезі/, 'сылезі'],
	[/сілік(?=[ао])/, 'сылік'],
	[/сімвал /, 'сымбаль '],
	[/сімвалы/, 'сымбалі'],
	[/сімв([ао])лі/, 'сымб$1лі'],
	[/сімвалам /, 'сымбалем '],
	[/сімвала/, 'сымбаля'],
	[/сіміл/, 'сыміл'],
	[/сімпат/, 'сымпат'],
	[/сімпозіум/, 'сымпозіюм'],
	[/сімпт([ао])м/, 'сымпт$1м'],
	[/трэнажор/, 'сымулятар'],
	[/сімуля(?=[внц])/, 'сымуля'],
	[/сімф([ао])ні/, 'сымф$1ні'],
	[/сінагог/, 'сынагог'],
	[/сінгапур/, 'сынгапур'],
	[/сіндром/, 'сындром'],
	[/сіндыка/, 'сындыка'],
	[/сінкрэт/, 'сынкрэт'],
	[/сінод/, 'сынод'],
	[/сінонім/, 'сынонім'],
	[/сінтакс/, 'сынтакс'],
	[/сінтэ(?=[зт])/, 'сынтэ'],
	[/сінус/, 'сынус'],
	[/сінхр(?=[ао])/, 'сынхр'],
	[/сіры(?=[ійя])/, 'сыры'],
	[/сістэм/, 'сыстэм'],
	[/сітуацы/, 'сытуацы'],
	[/сіфіліс/, 'сыфіліс'],
	[/сіцылі/, 'сыцылі'],
	[/скінхэд/, 'скінгэд'],
	[/ скіпет/, ' скіпэт'],
	[/славакія/, 'слава(кія|ччына)'],
	[/славакіі/, 'слава(кіі|ччыны|ччыне)'],
	[/славакію/, 'слава(кію|ччыну)'],
	[/славакій/, 'славаччын'],
	[/ спенсер/, ' спэнсэр'],
	[/спе(?=ц|кт|рм)/, 'спэ'],
	[/стоўбц/, 'стоўпц'],
	[/страус/, 'стра(ў|ву)с'],
	[/сцюардэс/, 'стуардэс'],
	[/стыпенд/, 'стыпэнд'],
	[/стэлаж/, 'стэляж'],
	[/стэлю /, 'стэлу '],
	[/стэлі /, 'стэлы '],
	[/сувенір/, 'сувэнір'],
	[/суверэн/, 'сувэрэн'],
	[/схалас/, 'схаляс'],
	[/сюзерэн/, 'сюзэрэн'],
	[/тві(?=ст|н)/, 'тўі'],
	[/транзіт/, 'транзыт'],
	[/трансільв/, 'трансыльв'],
	[/трапе(?=[зц])/, 'трапэ'],
	[/ трыа /, ' трыё '],
	[/цю(?=баж|бінг|льпан|рбан)/, 'ту'],
	[/(?<men>ар|бізнэс|да|рэкардс|спартс|турк)мен/, '$<men>мэн'],
	[/цюрынгі(?=\S)/, 'турынґі'],
	[/ цюрынг/, ' тʼюрынґ'],
	[/турцыя/, 'тур(цыя|эччына)'],
	[/турцыі/, 'тур(цыі|эччыны|эччыне)'],
	[/турцыю/, 'тур(цыю|эччыну)'],
	[/турцый/, 'тур(цый|эччын)'],
	[/ цітмар/, ' тытма'],
	[/ ціт(ус)?(?:а(м|вы|мі)?|у|ы)? /, ' тытус$2 '],
	[/тэасоф/, 'тэазоф'],
	[/тэосаф/, 'тэозаф'],
	[/тэмпера/, 'тэмпэра'],
	[/тэнесі/, 'тэнэсі'],
	[/цёрнер/, 'тэрнэр'],
	[/ тэсе/, ' тэсэ'],
	[/ пап(?=ка|к[уі] |ак |цы )/, ' (пап|тэч)'],
	[/цюдар/, 'тʼюдар'],
	[/ белдіуу /, ' белдіу�у '],
	[/уу/, 'уў'],
	[/([уў])збе(?=[кц])/, '$1збэ'],
	[/([уў])нівэрсі/, '$1нівэрсы'],
	[/([уў])раўненн/, '($1раўне|раўна)ньн'],
	[/ віскас/, ' ўіскас'],
	[/ уэльс/, ' ўэйлз'],
	[/ у(?=[аіоуыэ])/, ' ў'],
	[/феерверк/, 'фаервэрк'],
	[/ феер/, ' фэер'],
	[/фавн/, 'фаўн'],
	[/фальклор/, 'фальклёр'],
	[/фалкленд/, 'фалькленд'],
	[/фальсіфі/, 'фальсыфі'],
	[/фунікулёр/, 'фунікулер'],
	[/фізі/, 'фізы'],
	[/філосаф/, 'філёзаф'],
	[/філасоф/, 'філязоф'],
	[/ філол/, ' філёл'],
	[/ філал/, ' філял'],
	[/фітнес/, 'фітнэс'],
	[/флярэнцій/, 'флярэнтый'],
	[/фла(?=тылі|манд)/, 'фля'],
	[/фло(?=[тц])/, 'флё'],
	[/ флор/, ' фл(ё|о)р'],
	[/фразеа/, 'фразэа'],
	[/ фрау /, ' фраў '],
	[/ фрэйд/, ' фройд'],
	[/фрыцюр/, 'фрытур'],
	[/феадал/, 'фэ(а|ў)дал'],
	[/федэра(?=[лц])/, 'фэдэра'],
	[/фельчар/, 'фэльчар'],
	[/фельд/, 'фэльд'],
	[/ферме(?=нт|р)/, 'фэрмэ'],
	[/фесце/, 'фэсьце'],
	[/фе(?=од|рм|ст)/, 'фэ'],
	[/феручч?/, 'фэручч'],
	[/фэрбанкс/, 'фэрбэнкс'],
	[/ферэнцы/, 'фэрэнцы'],
	[/ферэра/, 'фэрэра'],
	[/ фехт(?=[ау])/, ' фэхт'],
	[/фен([ао])мен/, 'фэн$1мэн'],
	[/ фен/, ' фэн'],
	[/фетыш/, 'фэтыш'],
	[/фюзеляж/, 'фюзэляж'],
	[/ хакслі /, ' гаксьлі '],
	[/абасід[зс]к(\S+) халіфат(\S*)/, 'халіфат$2 абасыдаў'],
	[/ абасід/, ' абасыд'],
	[/ саюз /, ' (саюз|зьвяз|хаўрус) '],
	[/саюзні(?=[кц])/, '(саюзь|хаўрусь)ні'],
	[/ хойнік/, ' хвойнік'],
	[/хаўзэн/, 'хгаўзэн'],
	[/хельсінк/, 'хэльсынк'],
	[/херсон/, 'хэрсон'],
	[/цыклаалк([аеі])н/, 'цыкляальк$1н'],
	[/цыліндр /, 'цыліндар '],
	[/ая (цэ|альвэо|вакуо|жырандо)ль /, 'ая $1ля '],
	[/ую (цэ|альвэо|вакуо|жырандо)ль /, 'ую $1лю '],
	[/ (цэ|альвэо|вакуо|жырандо)ль /, ' $1(ля|лю) '],
	[/ (цэ|альвэо|вакуо|жырандо)ллю /, ' $1ляй '],
	[/цэлафан/, 'цэляфан'],
	[/шакалад/, '(ш|ч)акаляд'],
	[/ шахід/, ' шагід'],
	[/ шах(|[аіу]|а[мў]|амі) /, ' шаг$1 '],
	[/([iы]) светлагорск /, '($1|$1я) (сьветлагорск|шацілавічы) '],
	[/([iы])м светлагорскам /, '($1|$1мі) (сьветлагорскам|шацілавічамі) '],
	[/ага светлагорска /, '(ага|ых) (сьветлагорску|шацілавічаў) '],
	[/аму светлагорску /, '(аму|ым) (сьветлагорску|шацілавічам) '],
	[/светлагорск /, '(сьветлагорск|шацілавічы) '],
	[/светлагорска /, '(сьветлагорску|шацілавічаў) '],
	[/светлагорску /, '(сьветлагорску|шацілавічам) '],
	[/светлагорскам /, '(сьветлагорскам|шацілавічамі) '],
	[/светлагорск/, '(сьветлагорск|шацілавіцк)'],
	[/шве(?=[дц])/, 'швэ'],
	[/швейцар/, 'швайцар'],
	[/шлагба[уў]м/, 'шлягбаўм'],
	[/шланг/, 'шлянг'],
	[/(штры|штэпс|грыф)ел/, '$1эл'],
	[/ шоу/, ' шоў'],
	[/ шафёр/, ' шофэр'],
	[/евангел/, 'эванґел'],
	[/егіп/, 'эгіп'],
	[/экзеку/, 'экзэку'],
	[/экспе(?=ды|рт)/, 'экспэ'],
	[/эксплуата/, 'эксп(лё|лю)ата'],
	[/эмансіп/, 'эмансып'],
	[/ эпапе/, ' эпапэ'],
	[/епарх/, 'эпарх'],
	[/ эскала/, ' эскаля'],
	[/эсперант/, 'эспэрант'],
	[/эстафет/, 'эстафэт'],
	[/ еў(?=р(?:а|о|ыпід)|патор|фра|фроні|харысты)/, ' эў'],
	[/эйфары/, 'эўфары'],
	[/экумен/, 'экумэн'],
	[/елісейск/, 'элізэйск'],
	[/энцыкла/, 'энцыкля'],
	[/энерг/, 'энэрг'],
	[/эфект/, 'эфэкт'],
	[/эфемер/, 'эфэмэр'],
	[/эцюд/, 'этуд'],
	[/эфіоп/, 'этыёп'],
	[/эфір/, 'этэр'],
	[/іўда/, 'юда'],
	[/іўдзе/, 'юдэ'],
	[/ятвяг/, 'я(т|ць)вяг'],
	[/алк([аеі])н/, 'альк$1н'],
	[/ балькан/, ' балкан'],
	[/(амі|цэлю|стахі|трэга)лоз([аеу])/, '$1лёз$2'],
	[/аміля/, 'аміла'],
	[/ксілоза/, 'ксылёза'],
	[/ксілулоза/, 'ксылюлёза'],
	[/ хімі(?=ю |яй? |чн)/, ' (хэ|хі)мі'],
	[/хіцін/, 'хітын'],
	[/пекцін/, 'пектын'],
	[/ (м?)анамер/, ' $1анамэр'],
	[/пент(?=[ао])/, 'пэнт'],
	[/гекс/, 'гэкс'],
	[/гепт/, 'гэпт'],
	[/(м?эт|прап|бут|пэнт|гэкс|гэпт)ан([ао])л /, '$1ан$2ль '],
	[/(м?эт|прап|бут|пэнт|гэкс|гэпт)ан([ао])л[ау] /, '$1ан$2лю '],
	[/(м?эт|прап|бут|пэнт|гэкс|гэпт)ан([ао])л[еы] /, '$1ан$2лі '],
	[/(м?эт|прап|бут|пэнт|гэкс|гэпт)ан([ао])ла(?=(?:м|ў|вы) )/, '$1ан$2ле'],
	[/(м?эт|прап|бут|пэнт|гэкс|гэпт)ан([ао])ла/, '$1ан$2ля'],
	[/метыл /, 'мэтыль '],
	[/метыл[ау] /, 'мэтылю '],
	[/метыл[еы] /, 'мэтылі '],
	[/метыла(?=(?:м|ў|вы|в[аы]я) )/, 'мэтыле'],
	[/метыла/, 'мэтыля'],
	[/этыл /, 'этыль '],
	[/этыл[ау] /, 'этылю '],
	[/этыл[еы] /, 'этылі '],
	[/этыла(?=(?:м|ў|вы|в[аы]я) )/, 'этыле'],
	[/этыла/, 'этыля'],
	[/прапіл /, 'прапіль '],
	[/іон/, 'іён'],
	[/іан/, 'іян'],
	[/радыеакт/, 'радыяакт'],
	[/рады[уў]с/, 'радыюс'],
	[/вадарод/, 'вада(род|твор)'],
	[/вуглярод/, 'вугля(род|твор)'],
	[/ліцій/, 'літ'],
	[/ліці[ея]/, 'літа'],
	[/ліцію/, 'літу'],
	[/ліці[іе]/, 'ліце'],
	[/фтор/, 'флёр'],
	[/марганец/, 'ма(рганец|нган)'],
	[/марганц(?=[ау])/, 'ма(рганц|нган)'],
	[/марганцы/, 'ма(рганцы|нгане)'],
	[/медзь/, '($&|сьпіж)'],
	[/медзі/, '($&|сьпіжу)'],
	[/меддзю/, '(медзьдзю|сьпіжам)'],
	[/медн/, '(мед|сьпіжар)н'],
	[/мышʼяк/, '($&|аршэнік)'],
	[/мышʼяком/, '($&|аршэнікам)'],
	[/ селен/, ' сэлен'],
	[/ ітрый/, ' ітар'],
	[/ ітры[ея]/, ' ітара'],
	[/ ітрыю/, ' ітару'],
	[/ ітрыі/, ' ітары'],
	[/берыл(?:ій)?/, 'бэрыл'],
	[/тэхнец(?:ый)?/, 'тэхнэц'],
	[/ паладыа /, ' па�ладыа '],
	[/непалад/, 'непа�лад'],
	[/палад(?:ый)?/, 'паляд'],
	[/серабро|сярэбра/, 'срэбра'],
	[/тэлур/, 'тэлюр'],
	[/ксенон/, 'ксэнон'],
	[/празеадым/, 'празэадым'],
	[/неадым/, 'нэадым'],
	[/ прамет(?:ый)?/, ' прамэт'],
	[/танталам/, 'танталем'],
	[/тантала/, 'танталя'],
	[/танталу/, 'танталю'],
	[/тантал/, 'танталь'],
	[/плацін/, 'пл(аці|яты)н'],
	[/вісмут/, 'бісмут'],
	[/палёній/, 'палён'],
	[/мендзялевій/, 'мендзялеў'],
	[/ набелі/, ' набэлі'],
	[/борый/, 'борыюм'],
	[/борыю/, 'борыюму'],
	[/борыя|борые(?=[вм])/, 'борыюма'],
	[/борые/, 'борыюме'],
	[/ хас(?:ій)? /, ' гас '],
	[/м[ае]йтнер(?:ый)?/, 'майтнэр'],
	[/флеровій/, 'флероў'],
	[/масковій/, '(маскоў|$&)'],
	[/масковіем/, 'масковам'],
	[/масковіе/, 'маскове'],
	[/масковію/, '(маскову|&#)'],
	[/тэнэсін(?=\S?\S?і?)/, 'тэнэс'],
	[/аганесон/, 'аганэсон'],
	[/кіслародзе/, '($&|тлене)'],
	[/кісларода /, '(кіслароду|тлену) '],
	[/ кісларод/, ' (кісларод|тлен)'],
	[/неон/, 'нэон'],
	[/ сер(ай?|у) /, ' се(р|рк)$1 '],
	[/ серы /, ' сер(ы|кі|цы) '],
	[/хлор/, 'хлёр'],
	[/хлар/, 'хляр'],
	[/ калій /, ' ка(ль|лі) '],
	[/ гелі/, ' гэлі'],
	[/ гэлій /, ' (гэ|г�е)(ль|лі) '],
	[/ гэлі(?=[юя] |е)/, ' (гэ|г�е)л'],
	[/ гэліі /, ' (гэ|г�е)ле '],
	[`(?<el>${els1[0] + els1[1]}|інд|франц|рад)ый `, '$<el> '],
	[`(?<el>${els1[3]})ы[ея]`, '$<el>а'],
	[`(?<el>${els1[3]})ыю`, '$<el>у'],
	[`(?<el>${els1[3]}|рад)ыі`, '$<el>зе'],
	[`(?<el>${els1[2]})ыі`, '$<el>ы'],
	[`(${els2[0]}|герман)ій`, '$1'],
	[`(${els2[1]})і[ея]`, '$1а'],
	[`(${els2[1]})ію`, '$1у'],
	[`(${els3}| тал)ій `, '$1ь '],
	[/ таліе/, ' тале'],
	[`(?<els3>${els3})і(?=[юя] |е)`, '$1<els3>'],
	[`(${els3})іі `, '$1е '],
	[
		/(антрэпрэн|бакс|грав|грым|гіпнатыз|паз|партн|плян|прыз|рэжыс|рэзан|сап|сутэн|трас|фантаз)ёр/,
		'$1эр',
	],
	[/(біле|брэ|ман|мушке|(ім|рэ|транс|экс)пар|салі)цёр/, '$1тэр'],
	[/(вальты|коміваяж|фура)жор/, '$1жэр'],
	[/(каска|мара|фура)дзёр/, '$1дэр'],
	[/браўз[еа]р/, 'браўз(э|а)р'],
	[/(?<ar>дыскаўнт|ляйт|мэлянж|пражэкт)ар/, '$<ar>(э|а)р'],
	[/(?<eor>парфум|фраз)[её]р/, '$<eor>эр'],
	[
		/(?<er>абсорб|акцыян|альб|амп|апазыцыян| вэзэр|гіп|дызайн|імп|інжын|каба-в|кам|кандыцыян|кіб|легіян|мільян|піян|пфайф|пэнсіян|рэвалюцыян|рэф|скан|скв|снайп| суп|сф|тайм| тап|трэн)ер/,
		'$<er>эр',
	],
	[/ супэрні/, ' суперні'],
	[/(вах|ліф|шах)цёр/, '$1тар'],
	[/ понцій/, ' понтыюс'],
	[/ понці/, ' понты'],
	[/блакір(?=[аоу])/, 'блякір'],
	[/арыенцір(?=[ауы] |а[мў] |амі? )/, 'арыентыр'],
	[
		/(?<ir>абстраг|акліматыз|акуп|(?:а|нацыя)наліз|баз|балянс|бляк|ваеніз|груп|імпан|імправіз|інсцэн|інфарм|іраніз|каляніз|каляпс|каталіз|культыв|курс|ма[рс]к|нэрв|плян|прагназ|праграм|прыватыз|рэаг|санкцыян|скан|трэн|тыпіз|урбаніз|фантаз|фарм|фінанс|фраз|функцыян)ір(?=[ау])/,
		'$<ir>',
	],
	[
		/(?<ir>анке|арыен|дыску|дэб[аю]|(?:ім|экс)пар|праек|інспэк|кантак|кансуль|паразі|тэс|фарма|цы)цір(?=[ау])/,
		'$<ir>т',
	],
	[/(?<ir>дэгра|ка|лікві)дзір(?=[ау])/, '$<ir>д'],
	[/(?<yr>ангаж|дэкляр|ігнар|тыраж|фініш|генэр)ыр(?=[ау])/, '$<yr>'],
	[/(?<yr>інду|кваліфі|права|фальсыфі)цыр(?=[ау])/, '$<yr>к'],
	[/(?<ir>кап|прэм)іра/, '$<ir>ія'],
	[/(?<ir>кап|прэм)іру/, '$<ir>ію'],
	[/(?<ir>дуб|кантра|капіту|прафі|пэда)ліра/, '$<ir>ля'],
	[/(?<ir>дуб|кантра|капіту|прафі|пэда)ліру/, '$<ir>лю'],
	[/(?<ir>ініцы|канстру|тату)іра/, '$<ir>я'],
	[/(?<ir>ініцы|канстру|тату)іру/, '$<ir>ю'],
	[/(бляк|балянс|інсцэн|плян|трэн|фарм)іроўкай/, '$1аваньнем'],
	[/(бляк|балянс|інсцэн|плян|трэн|фарм)іроўка/, '$1аваньне'],
	[/(бляк|балянс|інсцэн|плян|трэн|фарм)іроўкі/, '$1аваньня'],
	[/(бляк|балянс|інсцэн|плян|трэн|фарм)іроўцы/, '$1аваньні'],
	[/(бляк|балянс|інсцэн|плян|трэн|фарм)іроўцэ/, '$1аваньню'],
	[/праекціроўкай/, 'праектаваньнем'],
	[/праекціроўка/, 'праектаваньне'],
	[/праекціроўкі/, 'праектаваньня'],
	[/праекціроўцы/, 'праектаваньні'],
	[/праекціроўцэ/, 'праектаваньню'],
	[/рэгуліроўкай/, 'рэгуляваньнем'],
	[/рэгуліроўка/, 'рэгуляваньне'],
	[/рэгуліроўкі/, 'рэгуляваньня'],
	[/рэгуліроўцы/, 'рэгуляваньні'],
	[/рэгуліроўцэ/, 'рэгуляваньню'],
	[/бамбардзір(?=аваць|уе|уюць)/, 'бамб'],
	[/бамбардзіроўкай/, 'бамбаваньнем'],
	[/бамбардзіроўка/, 'бамбаваньне'],
	[/бамбардзіроўкі/, 'бамбаваньня'],
	[/бамбардзіроўцы/, 'бамбаваньні'],
	[/бамбардзіроўцэ/, 'бамбаваньню'],
	[/лідзір(?=[ау])/, 'лідэр'],
	[
		/(каніфол|кішэн|прымес|пэдал|ростан|сенажац|скрон|сувяз|тунэл|туфл|цюл|шампун)ей /,
		'$1(яў|ей) ',
	],
	[/цяней /, 'ц(яней|еняў|янёў) '],
	[/ касцей/, ' к(асьцей|осьцяў|асьцёў)'],
	[/ каней/, ' к(аней|оняў|анёў)'],
	[/ каня(?=[мх])/, ' к(аня|оня|анё)'],
	[/ абласцей /, ' (абласьцей|вобласьцяў) '],
	[/ валасцей /, ' (валасьцей|воласьцяў) '],
	[/ (най\S+|пра|ча)сцей/, ' $1сьцей'],
	[/сцей /, 'сьц(ей|яў) '],
	[/ (г|(?:най)?ч)асьц\(ей\)\(яў\) /, ' $1асьцей '],
	[
		/(абед| дон|енск|[іы]зм|завод|інстытут| канал|крым|(?:кле|пола|слу)цк|лёндан|мадрыд| рым)а /,
		'$1у ',
	],
	[/(бэрлін|нясвіж|парыж)а /, '$1(а|у) '],
	[/дуная /, 'дунаю '],
	[/ фесалёнік/, ' (тэс|с)алёнік'],
	[/ салёнік/, ' (с|тэс)алёнік'],
	[/ фе(?=адос|сал)/, ' тэ'],
	[/ фэ(?=рмапілы)/, ' тэ'],
	[/аўкштай(?:ці|ты)я/, '($&|аўкштота)'],
	[/аўкштай(?:ці|ты)і/, '($&|аўкштоты|аўкштоце)'],
	[/аўкштай(?:ці|ты)ю/, '($&|аўкштоту)'],
	[/ абялей(?= )/, ' (абялей|абэле)'],
	[/эжарэліс(?= )/, '($&|ажарэле)'],
	[/акмяне(?= )/, '($&|акмяны)'],
	[/аліўтс(?= )/, '($&|аліта)'],
	[/анікшчэй(?= )/, '($&|анікшты)'],
	[/ варэ(?=н(ы|а[мх]|амі) )/, ' (варэ|ара)'],
	[/біржай(?= )/, '($&|біржы)'],
	[/бірштанас(?= )/, '($&|бірштаны)'],
	[/вабальнінкас(?= )/, '($&|вабольнікі)'],
	[/варней(?= )/, '($&|варні)'],
	[/вілкавішкіс(?= )/, '($&|ваўкавішкі)'],
	[/віекшней(?= )/, '($&|векшнэ)'],
	[/укмярге(?= )/, '($&|вількамір)'],
	[/вількія(?= )/, '($&|вількі)'],
	[/вільнюс(?= )/, '($&|вільня)'],
	[/вільнюс[aе]/, '($&|вільні)'],
	[/вільнюсу/, '($&|вільнe)'],
	[/вільнюсам/, '($&|вільняй)'],
	[/вісагінас(?= )/, '($&|вісагіня)'],
	[/вянта(?= )/, '($&|вэнта)'],
	[/вяйсіеяй(?= )/, '($&|вяйсеі)'],
	[/вірбаліс(?= )/, '($&|вярзбалаў)'],
	[/гялгаўдзішкіс(?= )/, '($&|гелгудышкі)'],
	[/гаргждай(?= )/, '($&|горжды)'],
	[/грыгішкес(?= )/, '($&|грэгарава)'],
	[/даўгай(?= )/, '($&|даўгі)'],
	[/друскінінкай(?= )/, '($&|друскенікі|друзгенікі)'],
	[/ду(кш|ся)тас(?= )/, '($&|ду$1ты)'],
	[/езнас(?= )/, '($&|езна)'],
	[/зарасай(?= )/, '($&|езяросы)'],
	[/віевіс(?= )/, '($&|еўе)'],
	[/жагарэ(?= )/, '($&|жагоры)'],
	[/жыежмарэй(?= )/, '($&|жыжмары)'],
	[/каварскас(?= )/, '($&|каварск)'],
	[/кайшадорыс(?= )/, '($&|кашадары)'],
	[/кедайней(?= )/, '($&|кейданы)'],
	[/кяльме(?= )/, '($&|кельмы)'],
	[/кібартай(?= )/, '($&|кібарты)'],
	[/каўнас(?= )/, '($&|коўна)'],
	[/ каўнас/, ' (каўнас|коўн)'],
	[/крацінга(?= )/, '($&|крэтынга)'],
	[/купішкіс(?= )/, '($&|купішкі)'],
	[/куршэнай(?= )/, '($&|куршаны)'],
	[/лаздзіяй(?= )/, '($&|лазьдзея)'],
	[/лянтварыс(?= )/, '($&|ландвараў)'],
	[/лінкува(?= )/, '($&|лінкаў)'],
	[/мажэйкей(?= )/, '($&|мажэйкі)'],
	[/малетай(?= )/, '($&|маляты)'],
	[/марыямпале(?= )/, '($&|марʼямпаль)'],
	[/нямянчыне(?= )/, '($&|немянчын)'],
	[/нярынга(?= )/, '($&|нерынга)'],
	[/швянчонелей(?= )/, '($&|новыя&nbsp;сьвянцяны)'],
	[/пагегей(?= )/, '($&|пагегі)'],
	[/пабрадзе(?= )/, '($&|падбродзе)'],
	[/пакруойіс(?= )/, '($&|пакрой)'],
	[/панявежыс(?= )/, '($&|панявеж)'],
	[/пандэліс(?= )/, '($&|панядзелі)'],
	[/панямуне(?= )/, '($&|панямунь)'],
	[/плунге(?= )/, '($&|плунгяны)'],
	[/пасваліс(?= )/, '($&|посваль)'],
	[/прыекуле(?= )/, '($&|прэкуле)'],
	[/прыенай(?= )/, '($&|прэны)'],
	[/радзвілішкіс(?= )/, '($&|радзівілішкі)'],
	[/рокішкіс(?= )/, '($&|ракішкі)'],
	[/расяйней(?= )/, '($&|расены)'],
	[/рудзішкес(?= )/, '($&|рудзішкі)'],
	[/рамігала(?= )/, '($&|рэмігола)'],
	[/рыетавас(?= )/, '($&|рэтаў)'],
	[/салантай(?= )/, '($&|саланты)'],
	[/шальчынінкай(?= )/, '($&|салечнікі)'],
	[/сімнас(?= )/, '($&|сімна)'],
	[/скаўдзвіле(?= )/, '($&|скаўдвілі)'],
	[/смалінінкай(?= )/, '($&|смольнікі)'],
	[/субачус(?= )/, '($&|субоч)'],
	[/швянчоніс(?= )/, '($&|сьвянцяны)'],
	[/сяда(?= )/, '($&|сяды)'],
	[/таўраге(?= )/, '($&|таўрогі)'],
	[/трашкунай(?= )/, '($&|трашкуны)'],
	[/тракай(?= )/, '($&|трокі)'],
	[/ужвянціс(?= )/, '($&|ужвэнты)'],
	[/цяльшэй(?= )/, '($&|цельшы)'],
	[/цітувенай(?= )/, '($&|цытавяны)'],
	[/шэдува(?= )/, '($&|шадаў)'],
	[/шакей(?= )/, '($&|шакі)'],
	[/шаўляй(?= )/, '($&|шаўлі)'],
	[/скуодас(?= )/, '($&|шкуды)'],
	[/шылуце(?= )/, '($&|шылакарчма)'],
	[/шылале(?= )/, '($&|шылэле)'],
	[/ шылал/, ' (шылал|шылэл)'],
	[/шырвінтас(?= )/, '($&|шырвінты)'],
	[/арогала(?= )/, '($&|эйрагола)'],
	[/ арогал/, ' (арогал|эйрагол)'],
	[/эйшышкес(?= )/, '($&|эйшышкі)'],
	[/эляктрэнай(?= )/, '($&|электрэны)'],
	[/юрбаркас(?= )/, '($&|юрбург)'],
	[/ёнава(?= )/, '($&|янава)'],
	[/ёнішкеліс(?= )/, '($&|янішкеле)'],
	[/ёнішкіс(?= )/, '($&|янішкі)'],
	[/ барыспіл/, ' бары(сьпі|спа)л'],
	[/ бэрэзніў/, ' бярэ(зьні|зна)ў'],
	[/ дзмітровіцк/, ' дзьмітр(о|а)віцк'],
	[/ касцянтыніў/, ' ка(сьцянтыні|нстанціна)ў'],
	[/ сасніўк/, ' са(сьні|сно)ўк'],
	[/ трасцянэц/, ' трасьця(нэ|не)ц'],
	[/ фасці(?=[вў])/, ' фа(сьці|ста)'],
	[/ зеленалужск/, ' (зеленалуск|зялёналуск)'],
	[
		ia(
			'не',
			toOneLine(`(вы)?(бач[ауы]
бег[ла]
блыта[юц]
брал[аі]
буд(зе|у(ць|чы)?) 
ваш
веда(л[аі]|ць|ю(ць|чы)?|ў)
дума(л[аі]|ць|ю(ць|чы)?|ў)
зна(л[аі]|ць|ю(ць|чы)?)
кла(д |л|ў)
ма(е|ючы|ю(ць|чы)?)
ме(л|ў|ць)
мы(ц|л[аі])
пі(са|шу)(цц|чы|ць )?
ў?пэўн
ска(ж(а|уць)|за )
спал[аі]
трэба 
чу[елўцю])
веды
веліч
выраш
вы[дп]ал[еіяю]
выпад
гор(ш|ай)
гу(к|чн|ст)
дрэнн
іхн
карт\\S{0,4}[ \\)]
каш(ай?|амі|у|ы) 
лёгк
літар
лішн
(мен|бол|леп)(ш|ей)
мап\\S{0,4}[ \\)]
медз
мякк
наш([аы]я|ую|ых)
прыйдзеш
руш[аы]
ста(ў|не|нуць|л[аі])
таго
тое
тыя
ўвод
ўс[еёя]
фарб(а(ў|мі)?|у|ы)? 
ян `)
		),
		' ня ',
	],
	[
		ia(
			'без',
			toOneLine(`(вы)?(клад[ау]
мела 
мытых
піса[нц]
ска(жа|жуць|за) 
спал[аі]
чу[елўцю])
ваш
ведаў
велічы
выраш
вы[дп]але
выпад
гор(ш|ай)
гу(к|чн|ст)
дрэнн
іхн
карт\\S{0,4}[ \\)]
каш(ы|аў) 
лёгк
літар
лішн
медз
(мен|бол|леп|ш|ей)
мап\\S{0,4}[ \\)]
мякк
наш(ую|ых)
пішучы
руша
стаў
таго
ўвод
ўс[еёя]
фарб(аў|ы)? 
цукр[ау] 
ян`)
		),
		' бяз ',
	],
	[/(\S)([іы]) (аа|ба|генэ|кры|тэ)зіс /, '$1($2|ая) $3(зіс|за) '],
	[/ага (аа|ба|генэ|кры|тэ)зіс[ау] /, '(ага|ай) $1(зісу|зы) '],
	[/(\S)([іы])м (аа|ба|генэ|кры|тэ)зісам /, '$1($2м|ай) $3(зісам|зай) '],
	[/(\S)([іы])м (аа|ба|генэ|кры|тэ)зісе /, '$1($2м|ай) $3(зісе|зе) '],
	[/аму (аа|ба|генэ|кры|тэ)зісу /, '(аму|ай) $1(зісу|зе) '],
	[/(аа|ба|генэ|кры|тэ)зіс /, '$1(зіс|за) '],
	[/(аа|ба|генэ|кры|тэ)зісам /, '$1(зісам|зай) '],
	[/(аа|ба|генэ|кры|тэ)зісе /, '$1(зісе|зе) '],
	[/(аа|ба|генэ|кры|тэ)зісу /, '$1(зісу|зе|зы) '],
	[/(аа|ба|генэ|кры|тэ)зіса /, '$1(зісу|зы) '],
	[/(\S)([іы]) (апакаліп)сіс /, '$1($2|ая) $3(сіс|са) '],
	[/ага (апакаліп)сіс[ау] /, '(ага|ай) $1(сісу|сы) '],
	[/(\S)([іы])м (апакаліп)сісам /, '$1($2м|ай) $3(сісам|сай) '],
	[/(\S)([іы])м (апакаліп)сісе /, '$1($2м|ай) $3(сісе|се) '],
	[/аму (апакаліп)сісу /, '(аму|ай) $1(сісу|се) '],
	[/(апакаліп)сіс /, '$1(сіс|са) '],
	[/(апакаліп)сісам /, '$1(сісам|сай) '],
	[/(апакаліп)сісе /, '$1(сісе|се) '],
	[/(апакаліп)сісу /, '$1(сісу|се|сы) '],
	[/(апакаліп)сіса /, '$1(сісу|сы) '],
	[/катэхізіс/, 'катэ(хізіс|хізм)'],
	[/сынтаксіс/, 'сынтак(сіс|с)'],
	[/(кібер|фа)неты(?=[кч])/, '$1нэты'],
	[/цій /, '(цій|ці) '],
	[/пёрл - харбар/, 'пэрл - гарбар'],
	[/рымска - кат/, 'рыма - кат'],
	[/ іата /, ' і�ата '],
	[/ юнэска /, ' юнэск(а|о) '],
	[/ ната /, ' нат(а|о) '],
	[/ гдр /, ' (г|н)д�р '],
	[/ фрг /, ' фр(г|н) '],
	[/следванне /, 'сьле(дваньне|д) '],
	[/следваннем /, 'сьле(дваньнем|дам) '],
	[/следванні /, 'сьле(дваньні|ды|дзе) '],
	[/следванню /, 'сьле(дваньню|ду) '],
	[/следвання/, 'сьле(дваньня|дам)'],
	[/спадзяванне /, 'спа(дзяваньне|дзеў) '],
	[/спадзяваннем /, 'спа(дзяваньнем|дзевам) '],
	[/спадзяванні /, 'спа(дзяваньні|дзевы|дзеве) '],
	[/спадзяванню /, 'спа(дзяваньню|дзеву) '],
	[/спадзявання /, 'спа(дзяваньня|дзеву) '],
	[/спадзявання/, 'спа(дзяваньня|дзева)'],
	[/ступленне /, 'сту(пленьне|п) '],
	[/ступленнем /, 'сту(пленьнем|пам) '],
	[/ступленні /, 'сту(пленьні|пы|пе) '],
	[/ступленню /, 'сту(пленьню|пу) '],
	[/ступлення /, 'сту(пленьня|пу) '],
	[/ступлення/, 'сту(пленьня|па)'],
	[/ у а/, ' у (а|ва)'],
	[/ экск/, ' эк�ск'],
	[/нкск/, 'нск'],
	[/[ктцч]ск/, 'цк'],
	[/падскарб/, 'пад�скарб'],
	[/ райхск/, ' райх�ск'],
	[/ г[еэ]рцагс/, ' гэрцаг�с'],
	[/[гґзжхш]с(?=(?:к|тв)\S)/, 'с'],
	[/ адск/, ' ад�ск'],
	[/дс(?=к|тв)/, 'дз'],
	[/ (б|кнд|нот)р /, ' $1�р '],
	[/(\S\S[дт])р /, '$1ар '],
	[/мль /, 'маль '],
	[/([аеёіоуыэюя]) у/, '$1 ў'],
	[
		/ ў(?=́|балац|бел(?:[ьіюя]|ем)|дзеньск|зус|ль(?:тра|ры[кх])|мбра|нікум|ні(?:я|й[н ]|[ію] )|нта|нтэр|нцы|рвіс|рн|стр[аы]н|угра |эфа )/,
		' у',
	],
	[/шся /, 'сься '],
	[/(паме|прапар)шчык /, '$1ш�чык '],
	[/ншчык /, '(ншчык|ньнік) '],
	[/шчык /, '(шчык|нік) '],
	[/выбаршчык/, 'выбар(шчык|нік)'],
	[/зчык /, '(зчык|зьнік) '],
	[/([ыі])[уў](?=м|с[аеуы ])/, '$1ю'],
	[
		/(а|антабле|асарты|даку|дыя|ману|сакра|т[аэ]ста|камплі|мэнэдж|парля|фраг|цэ|інстру|экспэры|эле)мен(?=т|це )/,
		'$1мэн',
	],
	[
		/(бацьк|бераг|брат|вач|вуш|гарад|дам|даждж|дзьвяр|зуб|к[ауі]т|кіраўнік|канц|ляс|маст|на[гч]|пляч|пяск|раз|рук|сад|склад|стал|сын|сябр|хвальк|хляв|цягнік)ах /,
		'$1(а|о)х ',
	],
	[/(агн|вучн|грудз|каран|касьц)ях /, '$1(я|ё)х '],
	[/(кара|па)лях /, '$1(ля|лё)х '],
	[/во([лч])ах /, 'в(о$1а|а$1о)х '],
	[/дзеўках /, 'дз(еўка|яўко)х '],
	[/жлобах /, 'жл(оба|або)х '],
	[/молатах /, 'м(олата|алато)х '],
	[/родах /, 'р(ода|адо)х '],
	[/ йо/, ' ё'],
	[/ [ій]е/, ' е'],
	[/ [ій]у/, ' ю'],
	[/ [ій]а/, ' я'],
	[/ енг(\S*) сары/, ' іенг$1 сары'],
	[/ юд(?=[ауы]|ай|зе )/, ' іуд'],
	[
		/(бандэры|камары|к[ае]|манты|пэры|сэгіды|эскадры|дзэфірэ|сэві)ль(?=[іюя])/,
		'$1льл',
	],
	[/(до|дуэ|піра|балё|манта)нь(?=[іюя])/, '$1ньн'],
	[/трухільё/, 'трухільлё'],
	[/мінью/, 'міньню'],
	[/ ні(хто|чога|што) /, ' (н|ан)і$1 '],
	[/ нік([ао])(га|му) /, ' (нік$1|аніко)$2 '],
	[/ агр([ауы]|ай) /, ' аґр$1 '],
	[/ га(ем?|[йіюя]|[нз][аеуы]|ай) /, ' ґа$1 '],
	[/ ган(?=к|ак )/, ' ґан'],
	[/ґанконг/, 'ганконґ'],
	[/г([эе])ртын/, 'ґ$1ртын'],
	[/ навіга(?=[цт])/, ' навіґа'],
	[/ге/, 'ґе'],
	[/ ґера/, ' гера'],
	[/ґерэ/, 'герэ'],
	[/ ер([ао])гліф/, ' гер$1гліф'],
	[/здж/, 'ждж'],
	[/ пясч/, ' пяшч'],
	[
		/ (абʼектыва|абліга|абсорб|абстрак|абструк|ава|адміністра|адука|акамада|ака|актуаліза|актывіза|акупа|ак|алітэра|амбі|амуні|амэрыканіза|аната|англіза|апазы|апліка|апраба|апэля|апэра|апэрцэп|арганіза|аргумэнта|артыкуля|арыента|асацыя|асыгна|асыміля|асэніза|атрыбу|аўтаматыза|аўтанаміза|вака|вакцына|варыя|галюцына|генэра|града|дата|дырэк|дыстан|дысэрта|дыфэрэнцыя|дэвальва|дэгенэра|дэграда|дэдыка|дэкара|дэкляма|дэкляра|дэлега|дэманстра|дэнаміна|дэнанса|дэпарта|дэпута|дэструк|дэталіза|дэфіні|ідэаліза|ізаля|ілюміна|ілюстра|іміта|імправіза|інава|інвэнтарыза|інвэн|інвэсты|інгаля|індэкса|інʼек|ініцыя|(?:ін)?карпара|інкаса|інквізы|інкруста|інспэк|інсталя|інстан|інструк|інстыту|інсцэніза|інсынуа|інсьпіра|інтаксыка|інтана|інтрадук|інтраспэк|інтэгра|інтэн|інтэрвэн|інтэрпэля|інтэрпрэта|інфарма|інфля|інфэк|каалі|каапэра|кадэн|калек|каляніза|камбіна|кампазы|кампіля|камплек|кампліка|кампрамэта|кампэнса|кампэтэн|камуніка|каналіза|кананіза|каната|канвэн|канды|канстата|канструк|канстыту|кансульта|кансэрва|кантаміна|кантрыбу|канфігура|канфіска|канфэрэн|канцэп|карана|карэк|карэспандэн|кваліфіка|квінтэсэн|квітан|клясыфіка|кульміна|легаліза|лек|ліквіда|лякаліза|мабіліза|мадуля|мадыфіка|мадэрніза|маніпуля|маніфэста|матыва|містыфіка|мута|мэдыта|нава|наміна|на|нацыяналіза|нумара|пазы|палю|патэн|пашпартыза|пігмэнта|плянта|правака|правін|прадук|праек|прапор|пратэк|прэзумп|прэзэнта|публіка|пэленга|пэрсаніфіка|пэртракта|пэрыядыза|пэты|рата|ратыфіка|ра|рэак|рэаліза|рэвалю|рэгабіліта|рэгенэра|рэгістра|рэдак|рэзалю|рэзыдэн|рэзэрва|рэкамэнда|рэквізы|рэля|рэмінісцэн|рэпара|рэпатрыя|рэпэты|рэстара|рэстаўра|санк|спэк|спэцыяліза|стандартыза|стан|структурыза|стыліза|стымуля|субліма|сыміля|сытуа|сэк|сэнса|сэнтэн|трады|транскрып|трансплянта|трансфарма|трансьлітара|трансьля|трапэ|трэпана|турба|тэндэн|тэрміна|узурпа|уніфіка|фабрыка|фальсыфіка|фарма|фартыфіка|фартэ|фікса|фік|фрак|фрустра|фунда|функ|фэдэра|цывіліза|цыркуля|эвакуа|эвалю|эвангеліза|экзэку|экраніза|эксгума|экспазы|экспл[ёю]ата|экспліка|экспэды|экстрапаля|[iэ]?мігра|эмо|эсэн)цый /,
		' $1ц(ый|ыяў) ',
	],
	[
		/ (авар|ака?ц|амніст|антыпат|аратор|артэр|аўдытор|бактэр|бухгальтэр|валькір|гарант|гвард|дынаст|дэмакрат|дэспат|імпэр|інтэрмэд|інфузор|калёр|камэд|кансыстор|кансэрватор|канцыляр|катэгор|лябаратор|містэр|мэлёд|нутр|парод|парт|піцэр|пэрыпэт|пэрыфэр|рапсод|скумбр|стад|студ|стыпэнд|субсыд|сымпат|сымэтр|сэр|траектор|тэор|тэрытор|фантасмагор|фур|фэер|харт|хрэстамат|энцыкляпэд|этнаэор)ый /,
		' $1(ый|ыяў) ',
	],
	[
		/ (агрэс|акадэм|аказ|алігарх|анталёг|антыном|антыўтоп|анэкс|арм|аўтаном|біяграф|ваканс|вэрс|гартэнз|гегемон|гімназ|дывіз|дывэрс|дыскус|дыфуз|(?:арцы|архі)?дыяцэз|дэпрэс|ідыл|ілюз|імпрэс|інваз|інвэрс|калег|калён|каліз|каміс|кампан|камун|канвал|канвульс|кантуз|канфэс|канцэс|коп|кумпан|лін|літаграф|ліцэнз|маг|манаграф|манапол|манарх|міс|міталёг|мітрапол|мум|мэтрапол|онталёг|параф|патрыярх|паэз|прагрэс|прафэс|працэс|прэтэнз|рэал|рэвіз|рэгал|рэліг|рэлікв|рэпрэс|рэфлекс|рэцэнз|стратэг|стых|сымфон|сэс|тэлевіз|тэхналёг|ун|утоп|фаміл|фантаз|фатаграф|фізіяном|філ|флекс|флятыл|фоб|фэкал|храналёг|цырымон|экскурс|экспанс|элег|эміс|эпідэм|эпітаф|эроз)ій /,
		' $1(ій|іяў) ',
	],
	[/ (асамбл|ліл|[нп]адз)ей /, ' $1(ей|еяў) '],
	[/ (галер|ід|панац|партуп|транш|эмпір|эпап)эй /, ' $1(эй|эяў) '],
	[/(\S)\(\)\(/, '($1|$1'],
	[/ статуй /, ' стат(уй|уяў) '],
	[/ ((?:др|кар|м|прапан|сл|устан)о|ініцыяты|пэрспэкты|тра)ў /, ' $1(ў|ваў) '],
	[/ праў /, ' пра(ў|воў) '],
	[/ зямель /, ' з(ямель|емляў) '],
	[/ яблынь /, ' яблын(ь|яў) '],
	[/ расей /, ' расе(й|яў) '],
	[/�/, ''],
];
var rawSofters = [
	[/([лнц])\1(?=[еёіюяь])/, '$1ь$1'],
	[/(\S\S)дз?дз(?=[еёіюяь])/, '$1дзьдз'],
	[/адзьдз([ея])л/, 'аддз$1л'],
	[/ (п|н|пе?р)адзьдз/, ' $1аддз'],
	[/надзьдзіман/, 'наддзіман'],
	[/з(?=([бвзлмнц]|дз)[еёіюяь])/, 'зь'],
	[/с(?=[бвлмнпсфц][еёіюяь])/, 'сь'],
	[/ц(?=[вм][еёіюяь])/, 'ць'],
	[
		`( (?:б[ея]|пра|цера)?з) (\\(?)(?=[еёюяь]|([бвзйлмнпстфц]|дз)[еёіюяь]|імі? |іх(?:ні)?|${iwords})`,
		'$1ь $2',
	],
	[/([сз])ʼ(?=[яюеё])/, '$1ь'],
];
var gwords = [
	' ґб ',
	'ґг',
	'абрызґл',
	' аґюст',
	'анґол',
	'арґаніз',
	'арлінґтан',
	'арыґінал',
	' аўґс',
	'аўґуст',
	'аґрэст',
	' біґ ',
	' бразґ',
	'буґацьці',
	'бурґ',
	'вашынґт',
	'возґр',
	'вэдзґа',
	' гааґ',
	' ґабрыел',
	' ґазэт',
	' ґаксон',
	' ґалац',
	' ґалґоф',
	' ґалер',
	' ґаліле',
	' ґальґот',
	' ґамбі',
	' ґарант',
	' ґарсэт',
	'ґарыбальдзі',
	' ґаўс',
	' ґаян',
	'ґвалт',
	' ґётэ ',
	' ґзымс',
	' ґіём',
	' ґітлін',
	' ґлазґа ',
	' ґліцэрын',
	' ґлясар',
	' ґонт',
	' ґот',
	' ґоцц',
	' ґрадус',
	'ґранд',
	' ґрош',
	'ґрунт',
	' ґрэйвэз',
	'ґрэнобл',
	'ґрэнлянд',
	' ґузік',
	' ґуст ',
	' ґэлап',
	' ґэры ',
	' ґяд',
	' ґяндж',
	' джамалунґм',
	' джґа',
	' ірвінґ',
	' іґнар',
	' інтэґр',
	' калеґ',
	' кіплінґ',
	'леґенд',
	' лонґ',
	' лэнґлі ',
	' мазґ',
	' мэґі ',
	' мяґі ',
	' ніяґар',
	'пінґвін',
	'плявузґ',
	'праґрам',
	' розґ',
	' ролінґ',
	' рэдынґ',
	' сіґітас',
	' сійґ',
	'райхстаґ',
	' уґанд',
	' цуґл',
	'энэрґ',
].reverse();
var gobj = {
	г: 'ґ',
	Г: 'Ґ',
	ґ: 'г',
	Ґ: 'Г',
};
var wordlist = [];
var softers = [];
var arabLetters = [];
var arr = [
	[rawWordlist, wordlist],
	[rawSofters, softers],
	[rawArabLetters, arabLetters],
];
for (const [raw, obj] of arr)
	for (const [pattern, result] of raw) obj.push([RegExp(pattern, 'g'), result]);
for (const obj of [
	latinLetters,
	latinLettersUpperCase,
	greekLetters,
	greekLettersUpperCase,
	thWords,
])
	for (let i = 0; i < obj.length; i++) {
		const item = obj[i];
		item[0] = RegExp(item[0], 'g' + item[0].flags);
	}
for (const word of gwords)
	wordlist.push([RegExp(word.replace(/ґ/g, 'г'), 'g'), word]);

// src/dict/arab
var isObject = (arg) => typeof arg === 'object';
var isUpperCase = (str) => str === str.toUpperCase();
var getLastLetter = (word) => {
	for (let i = word.length - 1; i >= 0; i--)
		if (/\p{L}/u.test(word[i])) return word[i];
	throw new Error(`the last letter of the word ${word} not found`);
};
var NOFIX_CHAR = ' ￿ ';
var NOFIX_REGEX = new RegExp(NOFIX_CHAR, 'g');
var OPTIONAL_WORDS_REGEX = /\(.*?\)/g;
var G_REGEX = /[Ґґ]/g;
var ALPHABET = { CYRILLIC: 0, LATIN: 1, ARABIC: 2, GREEK: 3 };
var J = { NEVER: 0, RANDOM: 1, ALWAYS: 2 };
var VARIATION = { NO: 0, FIRST: 1, ALL: 2 };
var letters = {
	[ALPHABET.LATIN]: latinLetters,
	[ALPHABET.ARABIC]: arabLetters,
	[ALPHABET.GREEK]: greekLetters,
};
var lettersUpperCase = {
	[ALPHABET.LATIN]: latinLettersUpperCase,
	[ALPHABET.GREEK]: greekLettersUpperCase,
};
var tagApplications = {
	html: {
		F: (content) => `<tarF>${content}</tarF>`,
		H: (content) => `<tarH>${content}</tarH>`,
	},
	nonHtml: {
		F: (content) => `\x1B[32m${content}\x1B[0m`,
		H: (content) => `\x1B[35m${content}\x1B[0m`,
		L: (content) => `\x1B[35m${content}\x1B[0m`,
	},
};
var iaReplacer = ($0, $1, $2) =>
	$2.match(/[аеёіоуыэюя]/g)?.length === 1 ? $1 + 'я' + $2 : $0;
var afterTarask = [
	[/ [уў]асьнігл /g, ' уаснігл '],
	[/ сь(?=нід |мі )/g, ' с'],
	[/( б)е(зь? \S+)/g, iaReplacer],
	[/( н)е( \S+)/g, iaReplacer],
	[
		/( (?:б[ея]|пра|цера)?з) і(\S*)/g,
		($0, $1, $2) => (/([ая]ў|ну)$/.test($2) ? $1 + 'ь і' + $2 : $0),
	],
];
var taraskSync = (text, options = {}) => {
	const { abc = 0, j = 0, html = false, nonHtml = false } = options;
	const isHtmlObject = isObject(html);
	const isNonHtmlObject = isObject(nonHtml);
	if (isNonHtmlObject) {
		nonHtml.variations ||= 0;
	}
	const apply = html ? tagApplications.html : tagApplications.nonHtml;
	const noFix = [];
	const LEFT_ANGLE_BRACKET = html ? '&lt;' : '<';
	text = ` ${text.trim()}  `
		.replace(/�/g, '')
		.replace(/<([,.]?)((?:.|\s)*?)>/g, ($0, $1, $2) => {
			if ($1 === ',') return LEFT_ANGLE_BRACKET + $2 + '>';
			noFix[noFix.length] = $1 === '.' ? $2 : $0;
			return NOFIX_CHAR;
		})
		.replace(/г'(?![еёіюя])/g, 'ґ')
		.replace(/([\n\t])/g, ' $1 ')
		.replace(/ - /g, ' — ')
		.replace(/(\p{P}|\p{S}|\d)/gu, ' $1 ')
		.replace(/ ['`’] (?=\S)/g, 'ʼ')
		.replace(/\(/g, '&#40');
	let splittedOrig, splitted;
	splittedOrig = replaceWithDict(
		replaceWithDict(text, letters[abc]),
		lettersUpperCase[abc]
	).split(' ');
	text = (options.OVERRIDE_toTarask || toTarask)(
		text.toLowerCase(),
		replaceWithDict,
		wordlist,
		softers,
		afterTarask
	);
	if (j) text = replaceIbyJ(text, j === J.ALWAYS);
	if (abc === ALPHABET.GREEK) text = replaceWithDict(text, thWords);
	text = replaceWithDict(text, letters[abc]);
	splitted = text.split(' ');
	if (abc !== ALPHABET.ARABIC) splitted = restoreCase(splitted, splittedOrig);
	if (html || (isNonHtmlObject && nonHtml.nodeColors))
		splitted = toTags(
			splitted,
			splittedOrig,
			abc === ALPHABET.CYRILLIC,
			apply.F
		);
	text = splitted
		.join(' ')
		.replace(/&nbsp;/g, ' ')
		.replace(/ (\p{P}|\p{S}|\d|&#40) /gu, '$1');
	let gReplacer;
	if (abc === ALPHABET.CYRILLIC) {
		if (isHtmlObject) {
			gReplacer = html.g ? apply.H('$&') : ($0) => apply.H(gobj[$0]);
		} else if (isNonHtmlObject) {
			if (nonHtml.nodeColors) {
				gReplacer = nonHtml.h ? ($0) => apply.H(gobj[$0]) : apply.H('$&');
			} else if (nonHtml.h) {
				gReplacer = ($0) => gobj[$0];
			}
		}
	}
	if (gReplacer) text = text.replace(G_REGEX, gReplacer);
	if (noFix.length) text = text.replace(NOFIX_REGEX, () => noFix.shift());
	return (
		html ? finalizer.html(text) : finalizer.nonHtml(text, nonHtml)
	).trim();
};
var tarask = (...args) => new Promise((res) => res(taraskSync(...args)));
var restoreCase = (text, orig) => {
	for (let i = 0; i < text.length; i++) {
		const word = text[i];
		const oWord = orig[i];
		if (word === oWord) continue;
		if (word === oWord.toLowerCase()) {
			text[i] = oWord;
			continue;
		}
		if (!oWord[0] || !isUpperCase(oWord[0])) continue;
		if (word === 'зь') {
			text[i] = isUpperCase(orig[i + 1]) ? 'ЗЬ' : 'Зь';
		} else if (isUpperCase(getLastLetter(oWord))) {
			text[i] = word.toUpperCase();
		} else {
			text[i] =
				word[0] === '('
					? word.replace(/.*?(?=\))/, ($0) =>
							$0.replace(/[(|]./g, ($02) => $02.toUpperCase())
					  )
					: word[0].toUpperCase() + word.slice(1);
		}
	}
	return text;
};
var toTags = (text, orig, isCyrillic, applyF) => {
	for (let i = 0; i < text.length; i++) {
		const word = text[i];
		const oWord = orig[i];
		if (oWord === word) continue;
		const wordH = isCyrillic ? word.replace(G_REGEX, ($0) => gobj[$0]) : word;
		if (oWord === wordH) continue;
		if (!/\(/.test(word)) {
			if (word.length === oWord.length) {
				const wordLetters = word.split('');
				for (let j = 0; j < wordLetters.length; j++) {
					if (wordH[j] !== oWord[j]) wordLetters[j] = applyF(wordLetters[j]);
				}
				text[i] = wordLetters.join('');
				continue;
			}
			if (isCyrillic) {
				const word1 = word.replace(/ь/g, '');
				switch (oWord) {
					case word1:
						text[i] = word.replace(/ь/g, applyF('ь'));
						continue;
					case word1 + 'ь':
						text[i] = word.slice(0, -1).replace(/ь/g, applyF('ь')) + 'ь';
						continue;
				}
			}
		}
		const oWordEnd = oWord.length - 1;
		let fromStart = 0;
		let fromWordEnd = word.length - 1;
		let fromOWordEnd = oWordEnd;
		while (wordH[fromStart] === oWord[fromStart]) ++fromStart;
		while (wordH[fromWordEnd] === oWord[fromOWordEnd]) {
			--fromWordEnd;
			--fromOWordEnd;
		}
		if (oWord.length < word.length) {
			if (fromOWordEnd === oWordEnd) {
				text[i] = applyF(word);
				continue;
			}
			if (fromWordEnd < 0) fromWordEnd = 0;
		}
		text[i] =
			word.slice(0, fromStart) +
			applyF(word.slice(fromStart, fromWordEnd + 1)) +
			word.slice(fromWordEnd + 1);
	}
	return text;
};
var toTarask = (text, replaceWithDict, wordlist2, softers2, afterTarask2) => {
	text = replaceWithDict(text, wordlist2);
	softening: do {
		text = replaceWithDict(text, softers2);
		for (const [pattern, result] of softers2)
			if (result !== '$1дзьдз' && pattern.test(text)) continue softening;
		break;
	} while (true);
	return replaceWithDict(text, afterTarask2);
};
var replaceWithDict = (text, dict2 = []) => {
	for (const [pattern, result] of dict2) text = text.replace(pattern, result);
	return text;
};
var toJ = (vow, shortU) => vow + 'й ' + (shortU ? 'у' : '');
var replaceIbyJ = (text, always = false) =>
	text.replace(
		/([аеёіоуыэюя] )і (ў?)/g,
		always
			? ($0, $1, $2) => toJ($1, $2)
			: ($0, $1, $2) => (Math.random() >= 0.5 ? toJ($1, $2) : $0)
	);
var finalizer = {
	html: (text) =>
		text
			.replace(OPTIONAL_WORDS_REGEX, ($0) => {
				const options = $0.slice(1, -1).split('|');
				const main = options.shift();
				return `<tarL data-l='${options}'>${main}</tarL>`;
			})
			.replace(/ \n /g, '<br>'),
	nonHtml(text, options) {
		if (
			isObject(options) &&
			options.variations &&
			options.variations !== VARIATION.ALL
		) {
			const WORD_INDEX = options.variations;
			const replacer = ($0) => $0.slice(1, -1).split('|')[WORD_INDEX];
			text = text.replace(
				OPTIONAL_WORDS_REGEX,
				options.nodeColors
					? ($0) => tagApplications.nonHtml.L(replacer($0))
					: replacer
			);
		}
		return text.replace(/&#40/g, '(');
	},
};
export { taraskSync, tarask, gobj, VARIATION, J, ALPHABET };
