export default [
	['матэматычная кафедра', 'μαθεματίτσ̌ναυα καθεδρα'],
	['афінская арыфметыка', 'αθενσκαυα αρίθμετίκα'],
	['Фесалонікі, Салонікі', '(Θεσ|Σ)αλυονικι, (Σαλο|Σαλυο|Θεσαλυο)νικι'],
	['Тэарэма Піфагора', 'Θεαρεμα Πιθαγορα'],
	['Тэатр арыфметычнага тэрматэізму', 'Θεαταρ αρίθμετίτσ̌ναγα θερμαθειζμϋ'],
	[
		'Этычны тэзіс Томаса, Марты і Агаты',
		'Εθίτσ̌ν(ί|αυα) θε(ζισ|ζα) Θομασα, Μαρθί ι Αγαθί',
	],
	['Сінтэтычны трамбозавы лабірынт', 'Σίνθετίτσ̌νί θραμμποζαβί λυαμπιρίνθ'],
	[
		'Апатычны псіхапат на троне з паталогіяй',
		'Απαθίτσ̌νί πσίχαπαθ να θρονη ζ παθαλυογιυαυ',
	],
	[
		'Антрапагенны апафеоз лагарыфмаў з апафемы',
		'Ανθραπαγκηννί απαθεοζ λυαγαρίθμαΰ ζ απαθεμί',
	],
	['Базіраваць', 'Μπαζαβατσ’'],
] as const;
