// <*. is not specified by documentation, so may be changed in the future

export const general = [
	['Планета', 'Плянэта'],
	['<Планета>', '<Планета>'],
	['<.Планета>', 'Планета'],
	['<,Планета>', '<Плянэта>'],
	['<*Планета>', '<Планета>'],
	['<*.Планета>', 'Планета'],
	['<*,Планета>', '<Плянэта>'],
	['<--[<*.ТУТ>]', '<--[<*.ТУТ>]'],
	['<Медык> МЕДЫК', '<Медык> МЕДЫК'],
	['<Медык> <МЕДЫК', '<Медык> <МЕДЫК'],
	['<Медык> > медык >', '<Медык> > мэдык >'],
	['<Медык> > МЕДЫК >', '<Медык> > МЕДЫК >'],
] as const;

export const latin = [
	['Планета', 'Planeta'],
	['<Планета>', '<Планета>'],
	['<*Планета>', '<Płanieta>'],
	['<.Планета>', 'Планета'],
	['<*.Планета>', 'Płanieta'],
	['<*.Планета гарбузоў АААА>', 'Płanieta harbuzoŭ AAAA'],
	['<,Планета>', '<Planeta>'],
	['<*,Планета>', '<Płanieta>'],
] as const;
