export const change = [
	['жыццясцвярджальны план', 'жыцьцясьцьвярджальны плян'],
	[
		'Отарыналарынгалагічнае варэнне оталарынголага',
		'Отарыналярынгалягічнае варэньне оталярынголяга',
	],
	[
		'секцыя трыумфу селекцыйных селектараў',
		'сэкцыя трыюмфу сэлекцыйных сэлектараў',
	],
	['эскалатар эскалацыі вайберу', 'эскалятар эскаляцыі вайбэру'],
	[
		'скандый, натрый, натрыю, натрыевы, тэхнецыевы, тэхнецый, паладый, галіевы',
		'сканд, натар, натру, натравы, тэхнэцавы, тэхнэц, паляд, галевы',
	],
	[
		'Веерштрас, Лейбніц, Эбінгаўз/Эбінгхаўз',
		'Ваерштрас, Ляйбніц, Эбінґгаўз/Эбінґгаўз',
	],
	['марыянетка фон Неймана', 'марыянэтка фон Ноймана'],
	['лакацыя алакацыі рэлакантаў', 'лякацыя алякацыі рэлякантаў'],
	['кіслародны каланіяльны баланс', '(кіслародн|тленав)ы каляніяльны балянс'],
	// [
	// 	'неакласічны, неакансерватызм, неанацызм, неааванградызм, неапазітывіст, неакаланіяліст',
	// 	'нэаклясычны, нэакансэрватызм, нэанацызм, нэааванградызм, нэапазытывіст, нэакаляніяліст',
	// ],
	[
		'фларэнційска-бернардзінскі іанічны іон Тэсея',
		'флярэнтыйска-бэрнардынскі іянічны іён Тэсэя',
	],
	[
		' двухсотгоддзе вэксальных векслераў вёскі Цвярачус ',
		'двухсотгодзьдзе вэкс(э|а)льных вэксьлераў вёскі (Цьвярачус|Цьверач)',
	],
	['залісся і энергія залісся', 'залесь(ся|се) і энэрґія залесь(ся|се)'],
	['бугацці сірыус', 'буґацьці сырыюс'],
	['скіпетр вахабіта-джыхадзіста', 'скіпэтар вагабіта-джыгадзіста'],
	['гуслендам', 'гуслэндам'],
	['лен Вермланд', 'лэн Вэрмлянд'],
	['Квін оф Камберленд у Белфасце', 'К(ві|ўі)н оф Камбэрлэнд у Бэлфасьце'],
	[
		'дысемінацыя сейсмічнае актыўнасці нектарынаў',
		'дысэмінацыя сэйсьмічнае актыўнасьці нэктарынаў',
	],
	['перыгелій', 'пэрыгелій'],
	['квест на квесце', 'квэст на квэсьце'],
	['касцях касьцях', 'касц(я|ё)х касьцях'],
	['эксплуатацыя эксплуатуе', 'эксп(лё|лю)атацыя эксп(лё|лю)атуе'],
	[
		'хімічная хімічка i хімік займаюцца хіміяй',
		'(хэ|хі)мічная (хэ|хі)мічка i (хэ|хі)мік займаюцца (хэ|хі)міяй',
	],
	[
		'Блакіраваць блок блогаў бландына Зеўса і феміннай Феміды',
		'Блякаваць блёк блёгаў бляндына Зэўса і фэміннай Тэміды',
	],
	['Абасідскі Халіфат абасідаў', 'Абасыдзкі Халіфат абасыдаў'],
	[
		'Апсіда, адвербіялізацыя, адрэнаміметыкі, азена, акрапетальны, аксерафтол, фенамід, аберацыя, авеста',
		'Апсыда, адвэрбіялізацыя, адрэнамімэтыкі, азэна, акрапэтальны, аксэрафтол, фэнамід, абэрацыя, авэста',
	],
	['аксель, акселерограф, акселятар', 'аксэль, аксэлерограф, аксэлятар'],
	[
		'каталог калегіумаў біялагічных біёлагаў на лоджыі',
		'каталёг калеґіюмаў біялягічных біёлягаў на лёджыі',
	],
	[
		'аналагічны вектар ідэалогіі семіцкіх ідэолагаў асіміляцыі семітаў Аланду',
		'аналягічны вэктар ідэалёгіі сэміцкіх ідэолягаў асыміляцыі сэмітаў Алянду',
	],
	['арнамент на фундаменце', 'арнамэнт на фундамэнце'],
	[
		'медыцынскі медыятар метаінфармуе метанавую камету на камеце',
		'мэдыцынскі мэдыятар мэтаінфармуе мэтанавую камэту на камэце',
	],
	['экспедыцыя на прэзідыум вікіпедыі', 'экспэдыцыя на прэзыдыюм вікіпэдыі'],
	[
		'сарбент абсарбент у секцыі секстантаў',
		'сарбэнт абсарбэнт у сэкцыі сэкстантаў',
	],
	['Гегель', 'Гэґель'],
	[
		'ва Украіне, ва УКРАІНЕ, ВА УКРАІНЕ, у БЕЛДІУУ, у УАСНІГЛ',
		'ва Ўкраіне, ва УКРАІНЕ, ВА УКРАІНЕ, у БЕЛДІУУ, у УАСНІГЛ',
	],
	['СМІ, СНІД', 'СМІ, СНІД'],
	['Відзскі з Відзаў', 'Відзкі зь Відзаў'],
	['', ''],
] as const;

export const gwords = [
	'Арґентына',
	'Анґельшчына',
	'Ґедзімін',
	// 'Ґеймінґ',
	'Ґейл',
	// 'Ґеорґ',
	'Ґерґетаць',
	'Ґервяты',
	'інтэліґентны',
	'фоґель',
	'шваґер',
	'Руґен',
	'Рэґенсбурґ',
	'',
].map((input) => [input.replace(/ґ/g, 'г'), input] as const);

export const noChange = [
	'чатырохстворкавая шызафрэнія рыма-каталіцкага капірайта згарэлага лаўрышава-жармінскі',
	'случы салоніцкі васкрасенскі з календулай паланілі луіша',
	'звышскопішча апалонікаў',
	'праґрама УЭСТ',
	'падскокнуць і надскокнуць',
	'масфільм',
	'тлець, тля, для, днець, адмірал, адʼютант, мацнець, падвесьці, пэндзлік, на тле, пры мардве, у таварыстве, Латвія, Людвік, Людміла, Мардвілка, Цнянка, Ядвіга (побач зь Ядзьвіга), на Цне',
	'гай',
].map((input) => [input, input] as const);
