export default [
	['жыццясцвярджальны план', 'жыцьцясьцьвярджальны плян'],
	[
		'Отарыналарынгалагічнае варэнне оталарынголага',
		'Отарыналярынгалягічнае варэньне оталярынголяга',
	],
	['секцыя селекцыйных селектараў', 'сэкцыя сэлекцыйных сэлектараў'],
	['эскалатар эскалацыі вайберу', 'эскалятар эскаляцыі вайбэру'],
	[
		'скандый, натрый, натрыю, натрыевы, тэхнецыевы, тэхнецый, паладый, галіевы',
		'сканд, натар, натру, натравы, тэхнэцавы, тэхнэц, паляд, галевы',
	],
	['Веерштрас, Лейбніц', 'Ваерштрас, Ляйбніц'],
	['марыянетка фон Неймана', 'марыянэтка фон Ноймана'],
	['лакацыя алакацыі рэлакантаў', 'лякацыя алякацыі рэлякантаў'],
	['кіслародны каланіяльны баланс', '(кіслародн|тленав)ы каляніяльны балянс'],
	// [
	// 	'неакласічны, неакансерватызм, неанацызм, неааванградызм, неапазітывіст, неакаланіяліст',
	// 	'нэаклясычны, нэакансэрватызм, нэанацызм, нэааванградызм, нэапазытывіст, нэакаляніяліст',
	// ],
	[
		'фларэнційска-бернардзінскі іанічны іон',
		'флярэнтыйска-бэрнардынскі іянічны іён',
	],
	[
		' двухсотгоддзе вэксальных векслераў вёскі Цвярачус ',
		'двухсотгодзьдзе вэкс(э|а)льных вэксьлераў вёскі (Цьвярачус|Цьверач)',
	],
	['энергія залісся', 'энэрґія залесьсе'],
	['бугацці сірыус', 'буґацьці сырыюс'],
	['вахабіт-джыхадзіст', 'вагабіт-джыгадзіст'],
	['гуслендам', 'гуслэндам'],
	['лен Вермланд', 'лэн Вэрмлянд'],
	['Квін оф Камберленд у Белфасце', 'К(ві|ўі)н оф Камбэрлэнд у Бэлфасьце'],
	['сейсмічная актыўнасць нектарынаў', 'сэйсьмічная актыўнасьць нэктарынаў'],
	['перыгелій', 'пэрыгелій'],
	['квест на квесце', 'квэст на квэсьце'],
	['касцях касьцях', 'касц(я|ё)х касьцях'],
	['эксплуатацыя эксплуатуе', 'эксп(лё|лю)атацыя эксп(лё|лю)атуе'],
	[
		'хімічная хімічка i хімік займаюцца хіміяй',
		'(хэ|хі)мічная (хэ|хі)мічка i (хэ|хі)мік займаюцца (хэ|хі)міяй',
	],
	[
		'Блакіраваць блок блогаў бландына Зеўса і феміннай Феміды',
		'Блякаваць блёк блёгаў бляндына Зэўса і фэміннай Тэміды',
	],
	['Абасідскі Халіфат абасідаў', 'Абасыдзкі Халіфат абасыдаў'],
	[
		'Апсіда, адвербіялізацыя, адрэнаміметыкі, азена, акрапетальны, аксерафтол, фенамід, аберацыя, авеста',
		'Апсыда, адвэрбіялізацыя, адрэнамімэтыкі, азэна, акрапэтальны, аксэрафтол, фэнамід, абэрацыя, авэста',
	],
	['аксель, акселерограф, акселятар', 'аксэль, аксэлерограф, аксэлятар'],
	[
		'каталог калегіумаў біялагічных біёлагаў на лоджыі',
		'каталёг калеґіюмаў біялягічных біёлягаў на лёджыі',
	],
	[
		'аналагічны вектар ідэалогіі ідэолагаў асіміляцыі Аланду',
		'аналягічны вэктар ідэалёгіі ідэолягаў асыміляцыі Алянду',
	],
	['арнамент на фундаменце', 'арнамэнт на фундамэнце'],
	[
		'медыцынскі медыятар метаінфармуе метанавую камету на камеце',
		'мэдыцынскі мэдыятар мэтаінфармуе мэтанавую камэту на камэце',
	],
	['экспедыцыя на прэзідыум вікіпедыі', 'экспэдыцыя на прэзыдыюм вікіпэдыі'],
	[
		'сарбент абсарбент у секцыі секстантаў',
		'сарбэнт абсарбэнт у сэкцыі сэкстантаў',
	],
	['', ''],
] as const;

export const notToChange = [
	'чатырохстворкавая шызафрэнія рыма-каталіцкага капірайта згарэлага лаўрышава-жармінскі',
	'случы салоніцкі васкрасенскі з календулай паланілі луіша',
	'звышскопішча',
	// 'масфільм'
].map((input) => [input, input]);
