const notToChange = `чатырохстворкавая шызафрэнія рыма-каталіцкага капірайта згарэлага лаўрышава-жармінскі
случы салоніцкі васкрасенскі з календулай паланілі луіша звышскопішча${
	'' /*' масфільм'*/
}`;

export default [
	['жыццясцвярджальны план', 'жыцьцясьцьвярджальны плян'],
	['варэнне', 'варэньне'],
	['секцыя селекцыйных селектараў', 'сэкцыя сэлекцыйных сэлектараў'],
	['эскалатар эскалацыі вайберу', 'эскалятар эскаляцыі вайбэру'],
	[
		'скандый, натрый, натрыю, натрыевы, тэхнецыевы, тэхнецый, паладый, галіевы',
		'сканд, натар, натру, натравы, тэхнэцавы, тэхнэц, паляд, галевы',
	],
	['Веерштрас, Лейбніц', 'Ваерштрас, Ляйбніц'],
	['марыянетка фон Неймана', 'марыянэтка фон Ноймана'],
	['лакацыя алакацыі рэлакантаў', 'лякацыя алякацыі рэлякантаў'],
	['кіслародны каланіяльны баланс', '(кіслародн|тленав)ы каляніяльны балянс'],
	// [
	// 	'неакласічны, неакансерватызм, неанацызм, неааванградызм, неапазітывіст, неакаланіяліст',
	// 	'нэаклясычны, нэакансэрватызм, нэанацызм, нэааванградызм, нэапазытывіст, нэакаляніяліст',
	// ],
	[notToChange, notToChange],
	[
		'фларэнційска-бернардзінскі іанічны іон',
		'флярэнтыйска-бэрнардынскі іянічны іён',
	],
	[
		' двухсотгоддзе вэксальных векслераў вёскі Цвярачус ',
		'двухсотгодзьдзе вэкс(э|а)льных вэксьлераў вёскі (Цьвярачус|Цьверач)',
	],
	['энергія залісся', 'энэрґія залесьсе'],
	['бугацці сірыус', 'буґацьці сырыюс'],
	['вахабіт-джыхадзіст', 'вагабіт-джыгадзіст'],
	['гуслендам', 'гуслэндам'],
	['лен Вермланд', 'лэн Вэрмлянд'],
	['Квін оф Камберленд у Белфасце', 'К(ві|ўі)н оф Камбэрлэнд у Бэлфасьце'],
	['сейсмічная актыўнасць нектарынаў', 'сэйсьмічная актыўнасьць нэктарынаў'],
	['перыгелій', 'пэрыгелій'],
	['квест на квесце', 'квэст на квэсьце'],
	['касцях касьцях', 'касц(я|ё)х касьцях'],
	['эксплуатацыя эксплуатуе', 'эксп(лё|лю)атацыя эксп(лё|лю)атуе'],
	[
		'хімічная хімічка i хімік займаюцца хіміяй',
		'(хэ|хі)мічная (хэ|хі)мічка i (хэ|хі)мік займаюцца (хэ|хі)міяй',
	],
	['Зеўс і фемінная Феміда', 'Зэўс і фэмінная Тэміда'],
	['Абасідскі Халіфат абасідаў', 'Абасыдзкі Халіфат абасыдаў'],
	['', ''],
] as const;
