const notToChange =
	'шызафрэнія рыма-каталіцкага капірайта згарэлага лаўрышава-жармінскі';

export default [
	['жыццясцвярджальны план', 'жыцьцясьцьвярджальны плян'],
	['варэнне', 'варэньне'],
	['секцыя селекцыйных селектараў', 'сэкцыя сэлекцыйных сэлектараў'],
	['эскалатар эскалацыі вайберу', 'эскалятар эскаляцыі вайбэру'],
	[
		'скандый, натрый, натрыю, натрыевы, тэхнецыевы, тэхнецый, паладый, галіевы',
		'сканд, натар, натру, натравы, тэхнэцавы, тэхнэц, паляд, галевы',
	],
	['Веерштрас, Лейбніц', 'Ваерштрас, Ляйбніц'],
	['марыянетка фон Неймана', 'марыянэтка фон Ноймана'],
	['лакацыя алакацыі рэлакантаў', 'лякацыя алякацыі рэлякантаў'],
	['кіслародны каланіяльны баланс', '(кіслародн|тленав)ы каляніяльны балянс'],
	// [
	// 	'неакласічны, неакансерватызм, неанацызм, неааванградызм, неапазітывіст, неакаланіяліст',
	// 	'нэаклясычны, нэакансэрватызм, нэанацызм, нэааванградызм, нэапазытывіст, нэакаляніяліст',
	// ],
	[notToChange, notToChange],
	['бернардзінскі іанічны іон', 'бэрнардынскі іянічны іён'],
	// 519
	['фларэнційскі', 'флярэнтыйскі'],
	['', ''],
] as const;
